[
  {
    "tags": "andorra blue yellow red animal text vertical",
    "shortname": "ad",
    "name": "Andorra",
    "proportion": "7:10",
    "adopted": "1971",
    "symbolism": "The design is related to the flags of <a href=\"?q=france\">France</a>, <a href=\"?q=spain\">Spain</a>, Catalonia and Foix, the lands historically linked with Andorra.<br>A flag of three stripes is similar to that of the French Tricolor, while the pattern of a wider middle stripe can be noted on the Spanish flag.<br>The blue and red of the Andorran flag are also found on the French flag, with red and yellow also being the colors of the Catalan flag (as the old royal symbol of the Crown of Aragon) and the arms of the old County of Foix (currently part of France).<br>The coat of arms of Andorra in the center of the flag contains historical symbolism to Bishop of Urgell, Count of Foix, Catalonia, and the Viscounty of Béarn.<br>",
    "funfacts": "Although the three vertical stripes may at first appear to be of equal width, the centre yellow stripe is slightly wider than the other two so that the ratio of stripe widths is 8:9:8.<br>The design is similar to the flags of <a href=\"?q=romania\">Romania</a>, <a href=\"?q=moldova\">Moldova</a>, and <a href=\"?q=chad\">Chad</a> but these have stripes of equal width.<br>The coat of arms makes it one of 28 national flags to contain <a href=\"?q=christianity\">Christian</a> symbolism.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Andorra"
  },
  {
    "tags": "united arab emirates red green white black horizontal pan-arab",
    "shortname": "ae",
    "name": "United Arab Emirates",
    "proportion": "1:2",
    "adopted": "1971",
    "symbolism": "Red (Hashemite dynasty): Courage, bravery, hardiness, strength, and unity.<br>White (Umayyad dynasty): Cleanliness, honesty, peace, and purity.<br>Green (Fatimid dynasty): Prosperity, hope, joy, love, and optimism.<br>Black (Abbasid dynasty): Defeating enemies and strength of mind.<br>",
    "funfacts": "Contrary to popular belief; the black part of the flag does not refer to oil.<br>Abdullah Mohammed Al Maainah was only 19 years old when he designed the flag after a competition was held in the newspaper. He did not know that his design won the competition until the flag was hoisted since the newspaper was printed in black and white.<br>The design was inspired by a poem, written by 14th century poet Safi al-Din al-Hilli.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_United_Arab_Emirates"
  },
  {
    "tags": "afghanistan white black text motto name flag building",
    "shortname": "af",
    "name": "Afghanistan",
    "proportion": "1:2",
    "adopted": "2021",
    "symbolism": "White: The purity of faith and government of the Islamic movement of the Taliban.<br>Text: The Islamic declaration of faith, known as the \"shahada\".<br>",
    "funfacts": "During the 20th century, Afghanistan went through 19 national flags. More than any other country during that time period.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Afghanistan"
  },
  {
    "tags": "antigua barbuda red black blue white sun triangle",
    "shortname": "ag",
    "name": "Antigua and Barbuda",
    "proportion": "2:3",
    "adopted": "1967",
    "symbolism": "Black: The African ancestry of the people.<br>Blue: Hope and the Caribbean Sea.<br>Red: Energy or life of the people, V is the symbol of victory.<br>The successive colouring of yellow, blue, and white (from the sun down) also stands for the sun, sea, and sand.<br>",
    "funfacts": "A competition to design the flag was held in which more than 600 local people entered. The winning design was put forth by nationally well-known artist and sculptor Sir Reginald Samuel.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Antigua_and_Barbuda"
  },
  {
    "tags": "anguilla blue red white orange cross british animal",
    "shortname": "ai",
    "name": "Anguilla",
    "proportion": "1:2",
    "adopted": "1990",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>The coat of arms consists of three dolphins in a circular formation which stand for friendship, wisdom and strength.<br>The white in the background stands for peace, and the light blue represents the sea, as well as faith, youth, and hope.<br>",
    "funfacts": "Since Anguilla is a British overseas territory the flag features the <a href=\"?q=british\">British</a> flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Anguilla"
  },
  {
    "tags": "albania red black bird animal",
    "shortname": "al",
    "name": "Albania",
    "proportion": "5:7",
    "adopted": "2002",
    "symbolism": "The red stands for bravery, strength, valour and bloodshed, while the double-headed eagle represents the sovereign state of Albania.<br>",
    "funfacts": "The black double-headed eagle on a red field was Kastrioti's coat of arms and became famous when he led a revolt against the Ottoman Empire resulting in the independence of Albania from 1443 to 1479.<br>The symbol of the double-headed eagle was re-used by Albanian nationalists during the 18th, 19th and early 20th centuries as a symbol of their campaign for their country's independence from the Ottoman Empire.<br>On 28 November 1912, the Albanian Declaration of Independence was proclaimed in Vlora and the flag, raised by Ismail Qemali, was adopted as the symbol of the new nation.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Albania"
  },
  {
    "tags": "armenia red blue orange horizontal stripes",
    "shortname": "am",
    "name": "Armenia",
    "proportion": "1:2",
    "adopted": "1990",
    "symbolism": "Red: The Armenian Highland, the Armenian people's continued struggle for survival, maintenance of the Christian faith, Armenia's independence and freedom.<br>Blue: The will of the people of Armenia to live beneath peaceful skies.<br>Orange: The creative talent and hard-working nature of the people of Armenia.<br>",
    "funfacts": "Just over a year before Armenia declared its formal independence from the USSR, the tricolour replaced the 1952 Soviet flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Armenia"
  },
  {
    "tags": "angola red black star weapon horizontal stripes",
    "shortname": "ao",
    "name": "Angola",
    "proportion": "2:3",
    "adopted": "1975",
    "symbolism": "Red: Bloodshed - during Angola's colonial period, independence struggle, and in defense of the country.<br>Black: Africa.<br>Gear: Industrial workers and production.<br>Machete: Peasantry, agricultural production and the armed struggle.<br>Star: Shaped like the red star, symbolizes international solidarity and progress.<br>Yellow: The country's wealth.<br>",
    "funfacts": "The Angolan flag is based on the flag of the Popular Movement for the Liberation of Angola (MPLA), which fought Portuguese colonial rule and emerged as the ruling party of Angola following the Angolan Civil War. The MPLA flag is similar to the flag of Angola but features a star in place of the central emblem.<br>In 2003, a new, more \"optimistic\" flag was proposed by the Angolan Parliament, but it was not adopted. The design resembled the <a href=\"?q=costa rica\">Costa Rican flag</a> but featured a crude drawing of a sun in the middle which was meant to be reminiscent of cave paintings found in Tchitundo-Hulu cave.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Angola"
  },
  {
    "tags": "antarctica blue map white",
    "shortname": "aq",
    "name": "Antarctica",
    "proportion": "2:3",
    "adopted": "2002",
    "symbolism": "A plain white map of the continent on a blue background symbolizes neutrality.<br>",
    "funfacts": "Graham Bartram designed the flag using the United Nations as its model.<br>Antarctica has no official flag as the condominium that governs the continent has not yet formally selected one.<br>The nations of the Antarctic Treaty use their own national flags at their respective Antarctic research bases. Some nations however have their own flags for their Antarctic possessions.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Antarctica"
  },
  {
    "tags": "argentina blue white sun horizontal stripes face",
    "shortname": "ar",
    "name": "Argentina",
    "proportion": "5:8",
    "adopted": "1861",
    "symbolism": "Popular belief attributes the colors to those of the sky, clouds and the sun; some anthems to the flag like \"Aurora\" or \"Salute to the flag\" state so as well.<br>The emblem is known as the Sun of May (Spanish: Sol de Mayo). Historian Diego Abad de Santillán claimed that the Sun of May was a representation of the Inca sun god Inti.<br>",
    "funfacts": "The Sun of May in the Argentinian flag has 16 straight and 16 waved sunbeams.<br>It is one of only a few flags to contain a <a href=\"?q=face\">face</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Argentina"
  },
  {
    "tags": "american samoa blue white triangle red bird animal weapon",
    "shortname": "as",
    "name": "American Samoa",
    "proportion": "10:19",
    "adopted": "1960",
    "symbolism": "The red, white and blue represent the colors traditionally utilized by both the United States and Samoa.<br>The bald represents the U.S. and it clutches two Samoan symbols, alluding to America's guardianship over American Samoa, as well as evoking the Great Seal of the United States.<br>The symbols are a uatogi (a war club, representing the government's power) and a fue (a fly-whisk, representing the wisdom of traditional Samoan leaders).<br>",
    "funfacts": "Before the first Europeans set foot on the islands in the 18th century, Samoa did not use any flags.<br>Designed by high school student Fareti Sotoa in a competition at the Samoana High School.<br>A copy of the flag, which was brought to the moon by astronauts on four Apollo missions from 1969-1971, is on display at the Jean P. Haydon Museum in Pago Pago.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_American_Samoa"
  },
  {
    "tags": "austria red white horizontal stripes",
    "shortname": "at",
    "name": "Austria",
    "proportion": "2:3",
    "adopted": "1230",
    "symbolism": "According to legend, the flag was invented by Duke Leopold V of Austria as a consequence of his fighting during the Siege of Acre. After a fierce battle, his white surcoat was completely drenched in blood. When he removed his belt, the cloth beneath remained unstained, revealing the combination of red-white-red. So taken was he by this singular sight that he adopted the colours and scheme as his banner.<br>",
    "funfacts": "The Austrian triband originated from the arms of the Babenberg dynasty.<br>The flag is said to have inspired the national flag of <a href=\"?q=lebanon\">Lebanon</a> and the Stars and Bars, ancestor of the present U.S. state flag of Georgia.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Austria"
  },
  {
    "tags": "australia blue white red cross british star",
    "shortname": "au",
    "name": "Australia",
    "proportion": "1:2",
    "adopted": "1908",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Commonwealth star: Also known as the Federation star, represents the territories of the commonwealth.<br>Southern Cross: A constellation used to represent Australia since the early days of British settlement. Ivor Evans, one of the flag's designers, intended the Southern Cross to also refer to the four moral virtues ascribed to the four main stars by Dante: justice, prudence, temperance and fortitude.<br>",
    "funfacts": "The number of points on the stars of the Southern Cross on the modern Australian flag differs from the original competition-winning design, in which they ranged between five and nine points each, representing their relative brightness in the night sky.<br>The stars are named after the first five letters of the Greek alphabet, in decreasing order of brightness in the sky.<br>In order to simplify manufacture, the <a href=\"?q=british\">British</a> Admiralty standardised the four larger outer stars at seven points each, leaving the smaller, more central star with five points.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Australia"
  },
  {
    "tags": "aruba blue yellow red white star horizontal stripes whitney_smith",
    "shortname": "aw",
    "name": "Aruba",
    "proportion": "2:3",
    "adopted": "1976",
    "symbolism": "Blue: The sea that's surrounding the island of Aruba.<br>Yellow horizontal lines: Abundance of solidarity. They also represent Aruba's economy past and present. Aruba's main past industries consisted of Gold and Aloë Vera and present main income comes from tourism. Yellow also stands for the numerous local flora that blossom yellow flowers.<br>White: Peace as well as the purity of the hearts of Aruban people who strive for justice, order and liberty.<br>Red star: The four points of the compass and the different origins of the Aruban population that attracted people from all over the world. It also signifies love and a homage for the indigenous Arubans, that died at Frenchman's pass during a confrontation with the French for the liberty of the island.<br>",
    "funfacts": "The flag was designed in part by vexillologist <a href=\"?q=whitney+smith\">Whitney Smith</a>, who coined the term Vexillology.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Aruba"
  },
  {
    "tags": "åland islands aland blue yellow red cross",
    "shortname": "ax",
    "name": "Åland Islands",
    "proportion": "17:26",
    "adopted": "1954",
    "symbolism": "It is intended to resemble the <a href=\"?q=sweden\">Swedish flag</a> defaced by a red cross symbolizing <a href=\"?q=finland\">Finland</a>.<br>",
    "funfacts": "When Finland obtained independence from Russia in 1917, many Ålanders feared they would lose their Swedish culture and language which led to the native population starting a movement to unite with Sweden. This led to Finland, Sweden, and Russia appealing to the United Nations, who decided in favor of Ålander autonomy.<br>In 1952, new laws gave Åland the right to make its own flag and a proposed flag resembling the Swedish flag with a blue cross inside was rejected by the president. The final design ended up being the first proposed model. <br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_%C3%85land"
  },
  {
    "tags": "azerbaijan blue red green moon star horizontal stripes",
    "shortname": "az",
    "name": "Azerbaijan",
    "proportion": "1:2",
    "adopted": "1991",
    "symbolism": "Blue: Turkic Multinationalism and the Turkic heritage.<br>Red: Progress to establish a modern state and the development of democracy.<br>Green, crescent moon and star: Islam, the religion of majority of Azerbaijanis.<br>",
    "funfacts": "While the crescent moon and star are typically seen as markers of <a href=\"?q=islam\">Islam</a>, some historians and researchers disagree about why an eight-pointed star is used on the flag of Azerbaijan. Fatali Khan Khoyski points to the eight letters in the word \"Azerbaijan\" as written in Arabic. The eight points of the star are also thought to stand for the eight Turkic peoples of Azerbaijan. The problem is there are only seven Turkic peoples: Azeris, Ottomans, Jagatais, Tatars, Kipchaks, Selijuks, and Turkomans. It's possible the Kipchaks actually reflect two peoples, the Kazakhs and Kyrgyz, which would make eight.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Azerbaijan"
  },
  {
    "tags": "bosnia and herzegovina blue yellow triangle star",
    "shortname": "ba",
    "name": "Bosnia and Herzegovina",
    "proportion": "1:2",
    "adopted": "2001",
    "symbolism": "White, blue and yellow: Traditionally associated with Bosnian culture and history.<br>Triangle: The approximate shape of the territory of Bosnia and Herzegovina and the three main ethnic groups of Bosnia and Herzegovina: Bosniaks, Croats, and Serbs.<br>Blue and stars: Europe, the stars are meant to be infinite in number and thus they continue from top to bottom.<br>",
    "funfacts": "Some Bosniaks dislike or have no particular affinity for the flag, preferring the former Bosnian national flag used from 1992 to 1998 (which remains used by some Bosniaks as a sort of ethnic flag), or the former socialist-era Yugoslav flag instead.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Bosnia_and_Herzegovina"
  },
  {
    "tags": "barbados blue yellow weapon vertical stripes",
    "shortname": "bb",
    "name": "Barbados",
    "proportion": "2:3",
    "adopted": "1966",
    "symbolism": "Blue: Ocean surrounding the country and the sky.<br>Golden middle band: Sand.<br>Trident three points: The three principles of democracy: government of the people, government for the people, government by the people.<br>Trident broken lower part: A break from its status as a colony.<br>",
    "funfacts": "The trident symbol was taken from Barbados' colonial badge, where the trident of Poseidon is shown with Britannia holding it.<br>The design of the flag was created by Grantley W. Prescod and was chosen from an open competition arranged by the Barbados government.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Barbados"
  },
  {
    "tags": "bangladesh green red circle",
    "shortname": "bd",
    "name": "Bangladesh",
    "proportion": "3:5",
    "adopted": "1972",
    "symbolism": "Red circle: The sun rising over Bengal, and also the blood of those who died for the independence of Bangladesh.<br>Green: Lushness of the land of Bangladesh and the eternal youth of Bangladeshis.<br>",
    "funfacts": "The red disc is offset slightly toward the hoist so that it appears centred when the flag is flying.<br>On 16 December 2013, 27,117 people gathered at the National Parade Ground in Dhaka's Sher-e-Bangla Nagar and created a \"human flag\" which was recorded in Guinness Book of World Records as the world's largest human national flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Bangladesh"
  },
  {
    "tags": "belgium black yellow red vertical stripes",
    "shortname": "be",
    "name": "Belgium",
    "proportion": "13:15",
    "adopted": "1831",
    "symbolism": "The colours were taken from the coat of arms of the Duchy of Brabant, a gold lion with red claws and tongue on a black field.<br>The vertical design is probably based on the flag of <a href=\"?q=france\">France</a>.<br>",
    "funfacts": "In August 1830, the day after the rioting at the Brussels Opera and the start of the Belgian Revolution, the flag of France flew from the city hall of Brussels. The insurgents replaced it with a tricolour of red, yellow, and black horizontal stripes (similar to the one used during the Brabant Revolution of 1789-1790 which had established the United States of Belgium) made at a nearby fabric store. As a result, the Constitution of Belgium describes the colours of the Belgian nation as Red, Yellow, and Black, the reverse order shown in the official flag.<br>In January 1831, the stripes changed from horizontal to vertical, and in October, the flag attained its modern form, with the black placed at the hoist side of the flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Belgium"
  },
  {
    "tags": "burkina faso red green yellow star horizontal stripes pan-african",
    "shortname": "bf",
    "name": "Burkina Faso",
    "proportion": "2:3",
    "adopted": "1984",
    "symbolism": "Red: The revolution.<br>Green: The abundance of agricultural and natural riches.<br>Yellow star: The guiding light of the revolution.<br>",
    "funfacts": "The flag is coloured in the popular <a href=\"?q=pan-african\">Pan-African</a> colours of the <a href=\"?q=ethiopia\">Ethiopian flag</a>, reflecting both a break with the country's colonial past and its unity with other African ex-colonies.<br>The flag was changed when Upper Volta became Burkina Faso on 4 August 1984.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Burkina_Faso"
  },
  {
    "tags": "bulgaria white green red horizontal stripes",
    "shortname": "bg",
    "name": "Bulgaria",
    "proportion": "3:5",
    "adopted": "1990",
    "symbolism": "White: Peace, love, and freedom.<br>Green: The agricultural wealth of Bulgaria.<br>Red: The independence struggle and military courage.<br>",
    "funfacts": "The design was derived from the ethnic association of Bulgarians with their Slavic brothers the Russians. The <a href=\"?q=russia\">Russian flag</a> was modified by substituting blue for green.<br>A popular version of the flag, which has no official status, is also commonly known. It has the full coat of arms on the left of the flag, placed across the white and green fields only.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Bulgaria"
  },
  {
    "tags": "bahrain white red triangle tool",
    "shortname": "bh",
    "name": "Bahrain",
    "proportion": "3:5",
    "adopted": "2002",
    "symbolism": "The earliest known flags of Bahrain were plain red. In 1820, Bahrain signed a general maritime treaty with the British Empire, and as result, a white stripe was added to the flag to signify the treaty and to distinguish it from the flags commonly used by pirates.<br>In 1932, a serrated edge was added to the flag in order to differentiate it from those of its neighbours.<br>The serrated edge was later reduced to five white triangles to symbolize the five pillars of <a href=\"?q=islam\">Islam</a>.<br>",
    "funfacts": "It is sometimes mistaken for the flag of <a href=\"?q=qatar\">Qatar</a>, but that flag is maroon, not red, has more points (9) and normally has a much greater length-to-width ratio.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Bahrain"
  },
  {
    "tags": "burundi green red white cross star triangle circle diagonal",
    "shortname": "bi",
    "name": "Burundi",
    "proportion": "3:5",
    "adopted": "1982",
    "symbolism": "White: Peace.<br>Green: The nation's hopes placed on future development.<br>Red: The suffering of the nation during its freedom struggle.<br>Stars: The three major ethnic groups of Burundi: the Hutu, the Twa and the Tutsi. But also for the three elements of the national motto \"Unité, Travail, Progrès\" (Unity, Work and Progress). They also represent the loyalty that the citizens of the nations have pledged to their God, king and country.<br>",
    "funfacts": "When the monarchy ruled over Burundi, a variant flag featuring a karyenda (a drum said to have divine power) was used. It was believed that the drum's messages could be understood only by the mwami (rulers) who made it the laws of the state. Following the abolition of the monarchy in 1966, the karyenda was removed from the flag and replaced with a sorghum plant which is an important agricultural product of the country.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Burundi"
  },
  {
    "tags": "benin green yellow red horizontal stripes pan-african",
    "shortname": "bj",
    "name": "Benin",
    "proportion": "2:3",
    "adopted": "1959",
    "symbolism": "Green: The hope of a new democracy.<br>Red: The courage of the ancestors.<br>Yellow: The treasures of the nation.<br>",
    "funfacts": "On a continental level, the yellow, green and red represent the <a href=\"?q=pan-african\">Pan-African</a> movement.<br>The colours are the same as the ones utilized in the flag of <a href=\"?q=ethiopia\">Ethiopia</a>. This honours the oldest independent country in Africa and the only nation other than <a href=\"?q=liberia\">Liberia</a> to remain independent during the Scramble for Africa.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Benin"
  },
  {
    "tags": "saint barthélemy barthelemy white blue red yellow horizontal stripes animal bird crown building text cross fleur-de-lis star ribbon",
    "shortname": "bl",
    "name": "Saint Barthélemy",
    "proportion": "None",
    "adopted": "Unofficial flag",
    "symbolism": "Pelicans: Representing the local fauna.<br>Mural crown: Ancient symbol of the Greek gods protecting the cities.<br>The <a href=\"?q=fleur-de-lis\">fleurs-de-lis</a> (France), Maltese cross (Knights Hospitaller), and gold <a href=\"?q=crown\">crowns</a> (Sweden) are heraldic reminders of the island's history as a colony.<br>Eventually, the island returned to French rule and the official flag of Saint Barthélemy became the French tricolor.<br>",
    "funfacts": "The text says \"Ouanalao\" and is the local name of the island.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_and_coat_of_arms_of_Saint_Barth%C3%A9lemy"
  },
  {
    "tags": "bermuda red blue white cross british animal boat waves vegetation",
    "shortname": "bm",
    "name": "Bermuda",
    "proportion": "1:2",
    "adopted": "1999",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>The coat of arms shows a lion holding a shield which bears a picture of a shipwreck on a rock.<br>The red lion is a symbol of Great Britain and alludes to Bermuda's relationship with that country.<br>The shipwreck is a depiction of the British Sea Venture, carrying some 150 colonists bound for Virginia, when it was shipwrecked on shoals off Bermuda during a hurricane in 1609.<br>",
    "funfacts": "The flag is unusual for a British overseas territory in that it is used on land in a red ensign form; most other British overseas territories use a version of the blue ensign for general use ashore.<br>The Latin inscription on the coat of arms reads \"Quo Fata Farunt\" meaning \"Whither the Fates Carry (Us)\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Bermuda"
  },
  {
    "tags": "brunei yellow black white red stripes triangle text motto name hand ribbon moon flag diagonal",
    "shortname": "bn",
    "name": "Brunei",
    "proportion": "1:2",
    "adopted": "1959",
    "symbolism": "Yellow: The sultan of Brunei.<br>Crescent moon: <a href=\"?q=islam\">Islam</a>.<br>Parasol: Monarchy.<br>The hands at the side: Benevolence of the government.<br>The black and white stripes represent Brunei's chief ministers who were once joint-regents and then, after the sultan came of age, senior advisors.<br>",
    "funfacts": "The white stripe is roughly 12% wider than the black one.<br>On the crescent moon is the national <a href=\"?q=motto\">motto</a> of Brunei in Arabic: \"Always render service with God's guidance\". The ribbon is inscribed with \"Brunei, the Abode of Peace\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Brunei"
  },
  {
    "tags": "bolivia red yellow green horizontal stripes",
    "shortname": "bo",
    "name": "Bolivia",
    "proportion": "15:22",
    "adopted": "1851",
    "symbolism": "Red: Valour of the army.<br>Yellow: The richness of mineral resources.<br>Green: The fertility of the land.<br>",
    "funfacts": "There may be a connection with the yellow, blue, and red striped flag of “The Liberator,” Simón Bolívar, which formed the basis for the flags of <a href=\"?q=colombia\">Colombia</a>, <a href=\"?q=ecuador\">Ecuador</a>, and <a href=\"?q=venezuela\">Venezuela</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Bolivia"
  },
  {
    "tags": "bonaire blue white yellow red black triangle stripes star whitney_smith diagonal",
    "shortname": "bq",
    "name": "Bonaire",
    "proportion": "2:3",
    "adopted": "1981",
    "symbolism": "The blue and yellow triangles represent the sea and sun respectively while the dividing white strip represents the sky.<br>Red, white, and blue also show Bonaire's loyalty to the Kingdom of the Netherlands.<br>The black compass represents the population of Bonaire who comes from the four corners of the world.<br>The red six-pointed star represents the original six villages of Bonaire - Antriol, Nikiboko, Nort Saliña, Playa, Rincon and Tera Korá.<br>",
    "funfacts": "The flag was designed in part by vexillologist <a href=\"?q=whitney+smith\">Whitney Smith</a>, who coined the term Vexillology.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Bonaire"
  },
  {
    "tags": "brazil green yellow blue circle text motto star",
    "shortname": "br",
    "name": "Brazil",
    "proportion": "7:10",
    "adopted": "1992",
    "symbolism": "The green and yellow are from the previous imperial flag - the green represented the House of Braganza of Pedro I, the first Emperor of Brazil, while the yellow represented the House of Habsburg of his wife, Empress Maria Leopoldina.<br>The 27 stars represent the Brazilian states and Federal district.<br>The stars are grouped into constellations like the Southern Cross and the Scorpion and vary in sizes representing the size of the state.<br>",
    "funfacts": "Known in Portuguese as \"Verde e amarela\" (The Green and Yellow).<br>The ribbon has the national <a href=\"?q=motto\">motto</a> and says \"Ordem e Progresso\" (Order and Progress).<br>The star Spica is the only one above of the white band; it symbolises the only part of Brazilian territory in the northern hemisphere (and the State of Pará).<br>The positions of the stars depicts the sky over the city of Rio de Janeiro on November 15, 1889.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Brazil"
  },
  {
    "tags": "bahamas black blue yellow triangle horizontal stripes",
    "shortname": "bs",
    "name": "Bahamas",
    "proportion": "1:2",
    "adopted": "1973",
    "symbolism": "Gold: The shining sun, as well as other key land-based natural resources.<br>Blue: The water surrounding the country.<br>Black: The strength, vigour and force of the Bahamian people.<br>Triangle: Their \"enterprising and determined\" nature to cultivate the abundant natural resources on the land and in the sea.<br>",
    "funfacts": "The design incorporated the elements of various submissions made in a national contest for a new flag prior to independence.<br>The Bahamian flag is often used as a flag of convenience by foreign-owned merchant vessels because of easy registration and lack of qualification requirements for the crew.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Bahamas"
  },
  {
    "tags": "bhutan orange white triangle animal diagonal",
    "shortname": "bt",
    "name": "Bhutan",
    "proportion": "2:3",
    "adopted": "1969",
    "symbolism": "The dragon (\"druk\" in Dzongkha, the Bhutanese language) is from Bhutanese mythology.<br>Yellow: Civil tradition and temporal authority as embodied in the Druk Gyalpo, the Dragon King of Bhutan, whose royal garb traditionally includes a yellow kabney (scarf).<br>Orange: Buddhist spiritual tradition, particularly the Drukpa Kagyu and Nyingma schools.<br>Centered dragon: The equal importance of both civic and monastic traditions in the Kingdom of Druk (Bhutan) and evokes the strength of the sacred bond between sovereign and people.<br> White: Purity of inner thoughts and deeds that unite all the ethnically and linguistically diverse peoples of Bhutan.<br>Jewels held in Druk's claws: Bhutan's wealth and the security and protection of its people.<br>",
    "funfacts": "It was redesigned to match the measurements of the flag of India, which was believed to flutter better.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Bhutan"
  },
  {
    "tags": "bouvet island red white blue cross",
    "shortname": "bv",
    "name": "Bouvet Island",
    "proportion": "8:11",
    "adopted": "1821",
    "symbolism": "For symbolism regarding the Norwegian flag, see <a href=\"?q=norway\">Norway</a>.<br>",
    "funfacts": "In 1927 a Norwegian expedition erected a small hut, the Norwegian flag was hoisted and the island claimed for Norway.<br>In 1928 another expedition arrived but by then both the flagpole and hut had been washed away.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Bouvet_Island"
  },
  {
    "tags": "botswana blue white black horizontal stripes",
    "shortname": "bw",
    "name": "Botswana",
    "proportion": "2:3",
    "adopted": "1966",
    "symbolism": "Blue: Water as it is a precious resource in Botswana, which relies on agriculture and suffers from frequent droughts due to the dry and arid climate of the Kalahari Desert.<br>Black and white band: The harmony and cooperation between the people of different races who live in Botswana, as well as the racial diversity of the country. It also represent the stripes of the zebra, the national animal of Botswana.<br>",
    "funfacts": "Adopted in 1966 to replace the Union Jack, it has been the flag of the Republic of Botswana since the country gained independence that year.<br>It is one of the few African flags that utilises neither the colours of the <a href=\"?q=pan-african\">Pan-African</a> movement nor the colours of the country's leading political party.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Botswana"
  },
  {
    "tags": "belarus red green white horizontal stripes",
    "shortname": "by",
    "name": "Belarus",
    "proportion": "1:2",
    "adopted": "2012",
    "symbolism": "Red: Freedom and the sacrifice of the nation's forefathers.<br>Green: Life.<br>The decorative pattern (designed in 1917 by Matrona Markevich) is derived from local plants and flowers. Patterns like it are commonly used in Belarus for woven garments like the traditional ruchnik.<br>",
    "funfacts": "Changes made to the Soviet-era flag were the removal of communist symbols (the hammer and sickle and the red star) as well as the reversal of the colours in the ornament pattern.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Belarus"
  },
  {
    "tags": "belize white red white circle weapon tool horizontal stripes text motto ribbon vegetation boat waves human face",
    "shortname": "bz",
    "name": "Belize",
    "proportion": "3:5",
    "adopted": "1981",
    "symbolism": "The colors on the flag are respectively those of the country's national parties, the People's United Party (PUP), and United Democratic Party (Belize) (UDP).<br>The 50 leaves recall 1950, the year PUP came to power.<br>The coat of arms recalls the logging industry that first led to British settlement there. The figures, tools, and mahogany trees represent this industry.<br>",
    "funfacts": "The text says \"Sub Umbra Floreo\", meaning \"Under the Shade I Flourish\" and is the national <a href=\"?q=motto\">motto</a>.<br>Belize is the only country to have humans depicted as a major design element on its national flag.<br>It incorporates 12 different colors and shades, making it the most colorful national flag in the world.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Belize"
  },
  {
    "tags": "canada red white vertical stripes vegetation",
    "shortname": "ca",
    "name": "Canada",
    "proportion": "1:2",
    "adopted": "1965",
    "symbolism": "King George V declared the national colours of Canada to be red and white in 1921. Red is symbolic of England and white of France.<br>The maple leaf has been used as a Canadian emblem since the 18th century.<br>",
    "funfacts": "The number of points on the leaf has no special significance; the number and arrangement of the points were chosen after wind tunnel tests showed the current design to be the least blurry of the various designs when tested under high-wind conditions.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Canada"
  },
  {
    "tags": "cocos islands keeling islands green yellow star moon vegetation circle",
    "shortname": "cc",
    "name": "Cocos (Keeling) Islands",
    "proportion": "1:2",
    "adopted": "2004",
    "symbolism": "Palm tree: The islands' tropical flora.<br>Green and yellow: Australia's national colours.<br>Crescent moon: <a href=\"?q=islam\">Islam</a>.<br>The Southern cross: Australia and the Southern Hemisphere.<br>",
    "funfacts": "It was designed by territory resident Mohammed Minkom, who won a design contest as a teenager.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Cocos_(Keeling)_Islands"
  },
  {
    "tags": "congo blue yellow red triangle star stripes diagonal",
    "shortname": "cd",
    "name": "Democratic Republic of the Congo",
    "proportion": "3:4",
    "adopted": "2006",
    "symbolism": "Blue: Peace.<br>Red: The blood of the country's martyrs.<br>Yellow: The country's wealth.<br>Star: A radiant future for the country.<br>",
    "funfacts": "When the national flag of 1963 was reinstated in 2006, a lighter shade of blue was used.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Democratic_Republic_of_the_Congo"
  },
  {
    "tags": "central africa blue white green yellow red star horizontal stripes pan-african",
    "shortname": "cf",
    "name": "Central African Republic",
    "proportion": "3:5",
    "adopted": "1958",
    "symbolism": "Blue and white: France.<br>Green and yellow: Africa.<br>Red: France and Africa in unity and the respect that Europeans and Africans should have for each other.<br>Yellow star: Independence.<br>",
    "funfacts": "President Jean-Bédel Bokassa considered to replace the flag in 1976 following his conversion to <a href=\"?q=islam\">Islam</a> under the influence of Libyan leader Muammar Gaddafi.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Central_African_Republic"
  },
  {
    "tags": "congo brazzaville green yellow red triangle stripes diagonal pan-african",
    "shortname": "cg",
    "name": "Republic of the Congo",
    "proportion": "2:3",
    "adopted": "1991",
    "symbolism": "Green: The agriculture and forests of the Congo.<br>Yellow: The friendship and nobility of the Congolese people.<br>Red: Unexplained but from a continental viewpoint; the green, yellow and red are the colours of the <a href=\"?q=pan-african\">Pan-African</a> movement.<br>",
    "funfacts": "It is the only Pan-African flag to utilize a diagonal pattern in its design.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Republic_of_the_Congo"
  },
  {
    "tags": "switzerland red white cross",
    "shortname": "ch",
    "name": "Switzerland",
    "proportion": "1:1",
    "adopted": "1841",
    "symbolism": "White cross: The Christian cross and the field sign of the Old Swiss Confederacy.<br>Red: Some historians believe that it symbolised the blood of Christ, while others suggest that the choice was inspired by the colour of the old Bernese flag.<br>",
    "funfacts": "It is one of only two square sovereign-state flags, the other being the flag of <a href=\"?q=vatican+city\">Vatican City</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Switzerland"
  },
  {
    "tags": "côte d'ivoire cote divoire ivory coast orange white green vertical stripes",
    "shortname": "ci",
    "name": "Côte d'Ivoire (Ivory Coast)",
    "proportion": "2:3",
    "adopted": "1959",
    "symbolism": "Orange: The splendour of national blossoming, while also serving as a reminder of the Northern Savannas.<br>White: Glorifies peace in purity and union of hearts.<br>Green: Hope for the future, the luxuriant virgin forest of Ivory Coast, the first great source of national prosperity.<br>The vertical alignment of the stripes symbolises the dynamic youth which heads for the future under the national motto \"Union, Discipline and Work\".<br>",
    "funfacts": "When independence from France was declared in 1960, Augustin Loubao proposed changing the orange stripe to red, to symbolize a willingness to shed blood to defend the new republic but the existing flag was retained.<br>The <a href=\"?q=ireland\">Irish flag</a> has a similar colour layout to the Ivorian flag, but with the green on the hoist side and a longer proportion (1:2 instead of 2:3). Due to this similarity, in Northern Ireland, Ulster loyalists have sometimes desecrated the Ivorian flag, mistaking it for the Irish one.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Ivory_Coast"
  },
  {
    "tags": "cook islands blue white red cross british star circle",
    "shortname": "ck",
    "name": "Cook Islands",
    "proportion": "1:2",
    "adopted": "1979",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Stars: The fifteen islands that make up the Cook Islands.<br>Blue: The ocean and the peaceful nature of the inhabitants.<br>",
    "funfacts": "The fifteen islands are Tongareva, Rakahanga, Manihiki, Pukapuka, Nassau, Suwarrow, Palmerston, Aitutaki, Manuae, Takutea, Atiu, Mitiaro, Mauke, Rarotonga and Mangaia.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Cook_Islands"
  },
  {
    "tags": "chile red white blue star horizontal stripes",
    "shortname": "cl",
    "name": "Chile",
    "proportion": "2:3",
    "adopted": "1817",
    "symbolism": "Blue: The sky and the Pacific Ocean.<br>White: The snow-covered Andes.<br>Red: The blood spilled to achieve independence.<br>The star: May represent a guide to progress and honor while other interpretations says it represents an independent state.<br>",
    "funfacts": "The Chilean flag is also known in Spanish as \"La Estrella Solitaria\" (The Lone Star). Not to be confused with the flag of the US state of Texas (\"The Lone Star State\") which adopted its flag 22 years later than Chile.<br>According to the epic poem La Araucana, the colors were derived from those from the flag flown by the Mapuche during the Arauco War.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Chile"
  },
  {
    "tags": "cameroon green red yellow vertical stripes star pan-african",
    "shortname": "cm",
    "name": "Cameroon",
    "proportion": "2:3",
    "adopted": "1975",
    "symbolism": "Centre stripe: Unity; red is the colour of unity, and the star is referred to as \"the star of unity\".<br>Yellow: stands for the sun, and also the savannas in the northern part of the country.<br>Green: The forests in the southern part of Cameroon.<br>",
    "funfacts": "Cameroon was the second state to adopt the <a href=\"?q=pan-african\">Pan-African</a> colours.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Cameroon"
  },
  {
    "tags": "china red yellow star",
    "shortname": "cn",
    "name": "China",
    "proportion": "2:3",
    "adopted": "1949",
    "symbolism": "Red: The Chinese Communist Revolution.<br>Five stars and their relationships to each other: The unity of the Chinese people (the working class, the peasantry, the urban petite bourgeoisie, and the national bourgeoisie) under the leadership of the Communist Party of China (CPC).<br>",
    "funfacts": "Also often known as the Five-starred Red Flag.<br>The flag was officially unveiled and raised for the first time by Mao Zedong in Beijing's Tiananmen Square on October 1, 1949, at the formal announcement of the establishment of the People's Republic of China.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_China"
  },
  {
    "tags": "colombia yellow blue red horizontal stripes",
    "shortname": "co",
    "name": "Colombia",
    "proportion": "2:3",
    "adopted": "1861",
    "symbolism": "The flag symbolizes Colombian independence from Spain, gained on July 20, 1810.<br>Yellow: The riches of the country, the wealth of the Colombian soil, the gold, sovereignty, harmony, justice and agriculture, as well as the Sun, the source of light.<br>Blue: The sky above, the seas on Colombia's shores, the rivers that run through.<br>Red: The blood spilled for Colombia's independence and also the effort of Colombian people, their determination and perseverance.<br>",
    "funfacts": "The victory of \"The Liberator\" Simón Bolívar, at the Battle of Boyacá on August 7, 1819, assured the independence of Colombia, and in December of that year Colombia adopted as its national flag the horizontal tricolour of yellow, blue, and red under which Bolívar fought.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Colombia"
  },
  {
    "tags": "costa rica blue white red vegetation star mountain horizontal stripes text name ribbon flag",
    "shortname": "cr",
    "name": "Costa Rica",
    "proportion": "3:5",
    "adopted": "1906",
    "symbolism": "Blue: The sky, opportunities, idealism, and perseverance.<br>White: Peace, wisdom and happiness.<br>Red: The blood spilt by martyrs in defense of the country, as well as the warmth and generosity of the people.<br>The coat of arms depicts the isthmus between the Pacific Ocean and the Caribbean Sea, with 3 volcanoes. The 7 stars stand for the 7 provinces of Costa Rica.<br>",
    "funfacts": "The flag features a stylized version of the flag of itself.<br>The ribbon of the coat of arms says \"Republica de Costa Rica\" which is the full <a href=\"?q=name\">name</a> of Costa Rica in Spanish.<br>The blue, white and red horizontal design was created in 1848 by Pacífica Fernández, wife of then president José María Castro Madriz. Fernández was inspired by France's 1848 Revolution, and the creation of the French Second Republic.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Costa_Rica"
  },
  {
    "tags": "cuba blue white red triangle star horizontal stripes",
    "shortname": "cu",
    "name": "Cuba",
    "proportion": "1:2",
    "adopted": "1902",
    "symbolism": "The three blue stripes: The three military districts in which Cuba was divided at the time.<br>White: Purity of the patriot cause, the light.<br>Red triangle: Originating from the French Revolution and the three ideals of liberty, equality and fraternity: red for the blood and the courage.<br>Star: Independence.<br>",
    "funfacts": "It is one of the three flags of a currently communist country (the others being <a href=\"?q=laos\">Laos</a> and <a href=\"?q=nepal\">Nepal</a>) that does not use any <a href=\"?q=communist\">communist</a> symbolism.<br>It was the model for the flag of Puerto Rico adopted in 1892 by the Puerto Rican Revolutionary Committee, a pro-independence group that worked under the auspices of the Cuban Revolutionary Party.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Cuba"
  },
  {
    "tags": "cape verde blue white red yellow horizontal stripes star",
    "shortname": "cv",
    "name": "Cape Verde",
    "proportion": "2:3",
    "adopted": "1992",
    "symbolism": "Blue: The ocean and the sky.<br>The band of white and red: The road toward the construction of the nation, and its colours stand for peace (white) and effort (red).<br>The 10 stars: The main islands of the nation.<br>",
    "funfacts": "The original flag was nearly identical to the flag of <a href=\"?q=guinea-bissau\">Guinea-Bissau</a>. Their similarity evoked the plans to unite both countries, which were abandoned shortly after independence.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Cape_Verde"
  },
  {
    "tags": "curaçao curacao blue yellow white star horizontal stripes",
    "shortname": "cw",
    "name": "Curaçao",
    "proportion": "2:3",
    "adopted": "1984",
    "symbolism": "Blue: The sky and sea as well as the loyalty of the people.<br>Yellow: The bright sun which bathes the island and the happy nature of the people.<br>The two stars: Curaçao and Klein Curaçao, with the five points on each star symbolise the five continents from which Curaçao's people descend.<br>",
    "funfacts": "The design was chosen in a competition that received over 2,000 entries.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Cura%C3%A7ao"
  },
  {
    "tags": "christmas island blue green white yellow triangle star animal bird map diagonal",
    "shortname": "cx",
    "name": "Christmas Island",
    "proportion": "1:2",
    "adopted": "2002",
    "symbolism": "Blue and green: The sea and land respectively.<br>Stars: The Southern cross constellation refers to the southern hemisphere.<br>Bird: A golden bosun bird which is a symbol of the island.<br>Circle with map: A <a href=\"?q=map\">map</a> of the island on a disc representing the mining industry.<br>",
    "funfacts": "The flag was unofficially adopted in 1986 after being chosen the winner in a competition for a flag for the territory. It was designed by Tony Couch of Sydney, Australia who received a price of $100.<br>The Golden bosun bird is one of six races of the white-tailed tropicbird.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Christmas_Island"
  },
  {
    "tags": "cyprus white orange green vegetation map",
    "shortname": "cy",
    "name": "Cyprus",
    "proportion": "2:3",
    "adopted": "2006",
    "symbolism": "White: Peace.<br>A map of the island in copper-orange: The large deposits of copper ore on the island, from which it may have received its name.<br>Two olive branches: Peace between the island's two communities, Greek and Turkish Cypriots.<br>",
    "funfacts": "According to the constitution, private citizens may fly the flag of Cyprus alongside either the <a href=\"?q=greece\">Greek flag</a>, the <a href=\"?q=turkey\">Turkish flag</a>, or both.<br>A new flag has been designed by the United Nations in a plan to settle the Cyprus dispute but Greek Cypriots rejected the proposal.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Cyprus"
  },
  {
    "tags": "czechia white red blue triangle horizontal stripes pan-slavic",
    "shortname": "cz",
    "name": "Czech Republic",
    "proportion": "2:3",
    "adopted": "1920",
    "symbolism": "White: The people of the Czech Republic and their peaceful nature and honesty.<br>Red: Courage, valor and patriotism of the nation.<br>Blue: Vigilance, truth, loyalty and perseverance.<br>",
    "funfacts": "The Czech Republic flag colors are borrowed from the coat of arms of Bohemia. The blue triangle was added to the Czech flag in 1920 in order to differentiate it from the flag of Poland. It is said that the blue color is representing the State of Moravia.<br>Upon the dissolution of Czechoslovakia in 1993, the Czech Republic kept the Czechoslovak flag while <a href=\"?q=slovakia\">Slovakia</a> adopted its own flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Czech_Republic"
  },
  {
    "tags": "germany black red yellow horizontal stripes",
    "shortname": "de",
    "name": "Germany",
    "proportion": "3:5",
    "adopted": "1949",
    "symbolism": "During the Napoleonic Wars (1803-1815), the German struggle against the occupying French forces was significantly symbolised by the colours of black, red, and gold, which became popular after their use in the uniforms of the Lützow Free Corps, a volunteer unit of the Prussian Army. This unit had uniforms in black with red facings and gold buttons. At the time, the colours represented:<br>Out of the blackness (black) of servitude through bloody (red) battles to the golden (gold) light of freedom.<br>",
    "funfacts": "At the time of the adoption of the flag there were no exact colour specifications other than \"Black-Red-Gold\", this was fixed in 1999.<br>When the black-red-gold tricolour was adopted by the Weimar Republic as its flag, it was attacked by conservatives, monarchists, and the far right, who referred to the colours with spiteful nicknames such as Schwarz-Rot-Gelb (black-red-yellow) or even Schwarz-Rot-Senf (black-red-mustard).<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Germany"
  },
  {
    "tags": "djibouti white blue green red triangle horizontal stripes star",
    "shortname": "dj",
    "name": "Djibouti",
    "proportion": "2:3",
    "adopted": "1977",
    "symbolism": "Blue: The sky and the sea, as well as the Issa Somalis.<br>Green: The everlasting green of the earth, as well as the Afars (ethnic group inhabiting the Horn of Africa).<br>White: Peace.<br>Red star: Unity and the blood shed by the martyrs of independence.<br>",
    "funfacts": "The flag is an adaptation of the flag of the Front for the Liberation of the Somali Coast (FLCS), a guerrilla group that led Djibouti with the Ligue Populaire Africaine pour l'Independence (LPAI) to independence.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Djibouti"
  },
  {
    "tags": "denmark red white cross",
    "shortname": "dk",
    "name": "Denmark",
    "proportion": "28:37",
    "adopted": "1219",
    "symbolism": "White: Peace and honesty.<br>Red: Hardiness, bravery, strength and valour.<br>The cross is a Nordic <a href=\"?q=cross\">cross</a> which represent <a href=\"?q=christianity\">Christianity</a>.<br>",
    "funfacts": "The flag holds the world record of being the oldest continuously used national flag.<br>According to legend, the Danish flag fell from heaven on June 15, 1219, during the Battle of Lyndanisse (near modern Tallinn, Estonia) as a sign from God of his support for King Valdemar II against the pagan Estonians.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Denmark"
  },
  {
    "tags": "dominica green yellow black white red purple star circle bird animal horizontal vertical stripes",
    "shortname": "dm",
    "name": "Dominica",
    "proportion": "1:2",
    "adopted": "1990",
    "symbolism": "Green: The lush vegetation of the island.<br>The cross: The Trinity and <a href=\"?q=christianity\">Christianity</a>, with its three colours symbolising the natives, the fertile soil, and the pure water.<br>The 10 green five-pointed stars stand for the country's 10 parishes.<br>Red disc: Justice.<br>The bird is a depiction of the sisserou parrot which is an endangered species with a population of only 250-350 individuals and endemic to the Dominica.<br>",
    "funfacts": "The original flag was designed by playwright Alwin Bully in early 1978 as the country prepared for independence.<br>The 10 parishes of Dominica are called; St Andrew, St David, St George, St John, St Joseph, St Luke, St Mark, St Patrick, St Paul, and St Peter.<br>The use of purple makes the flag of Dominica one of only two flags of sovereign states (alongside the flag of <a href=\"?q=nicaragua\">Nicaragua</a>) to contain the colour.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Dominica"
  },
  {
    "tags": "dominican republic blue red white weapon cross ribbon cross text motto name flag",
    "shortname": "do",
    "name": "Dominican Republic",
    "proportion": "2:3",
    "adopted": "1863",
    "symbolism": "Blue: Liberty.<br>White: Salvation.<br>Red: Blood of heroes.<br>The coat of arms contains <a href=\"?q=christianity\">Christian</a> symbols in front of the flag of itself.<br>",
    "funfacts": "The coat of arms has a blue ribbon that displays the national <a href=\"?q=motto\">motto</a> \"Dios, Patria, Libertad\" (God, Fatherland, Liberty).<br>The Dominican revolutionary group known as La Trinitaria, who led the independency movement against Haitian rule, emphasized its Christian heritage by placing a white cross on the background of the previously blue-red flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Dominican_Republic"
  },
  {
    "tags": "algeria green white red vertical stripes star moon",
    "shortname": "dz",
    "name": "Algeria",
    "proportion": "2:3",
    "adopted": "1961",
    "symbolism": "Green: <a href=\"?q=islam\">Islam</a>.<br>White: Peace and purity but also a reminder of Emir Abdelkader, who used a white flag in his fight against the French colonial invasion.<br>Red: Liberty.<br>The crescent moon and star are also Islamic symbols, but the crescent moon is more closed than those of other Muslim countries because Algerians believe the long crescent moon horns bring happiness.<br>",
    "funfacts": "Émilie Busquant (French feminist and anti-colonial activist married to Algerian nationalist leader Messali Hadj) is perhaps best known as the creator of the current Algerian flag. While there is some dispute over who exactly designed green and white with red star and crescent moon symbol, Busquant is generally credited as having sewed the first version of the flag in 1934.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Algeria"
  },
  {
    "tags": "ecuador yellow blue red horizontal stripes weapon mountain boat sun vegetation ribbon animal bird flag",
    "shortname": "ec",
    "name": "Ecuador",
    "proportion": "2:3",
    "adopted": "1860",
    "symbolism": "Yellow: The crops and the fertile soil.<br>Blue: The ocean and the clear skies.<br>Red: Freedom and the blood spilled by the heroes who died in the name of their countrymen's Fatherland.<br>Coat of arms: The condor on top of the shield stretches his wings to symbolize power, greatness and strength of Ecuador. In the background of the oval shield is the mountain Chimborazo which is the highest mountain in Ecuador. The was built in Guayaquil and was the first seaworthy steamship built in all of South America. The has the features of a Caduceus representing trade and economy. The laurel on the left represents the victories of the republic. The palm leaf on the right side is a symbol of the martyrs of the fight for independence and liberty. The bundle of wood (Fasces) below the shield represents the republican dignity.<br>",
    "funfacts": "The coat of arms contains a depiction of the flag itself.<br>The flags of <a href=\"?q=colombia\">Colombia</a>, Ecuador, and <a href=\"?q=venezuela\">Venezuela</a> are based on a proposal by Venezuelan General Francisco de Miranda, which was adopted by Venezuela in 1811 and later Gran Colombia with some modifications.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Ecuador"
  },
  {
    "tags": "estonia blue black white horizontal stripes",
    "shortname": "ee",
    "name": "Estonia",
    "proportion": "7:11",
    "adopted": "1990",
    "symbolism": "Blue: Endurance and the reflection of the sky in the lakes and the sea.<br>Black: The earth that feeds the people.<br>White: An aspiration towards light and purity.<br>",
    "funfacts": "It was officially first adopted as a student organisation flag.<br>Politician Kaarel Tarand suggested in 2001 that the flag be changed from a tricolour to a Scandinavian-style cross design with the same colours. Advocates for a nordic flag state that Estonians consider themselves a Nordic nation rather than Baltic.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Estonia"
  },
  {
    "tags": "egypt red white black yellow horizontal stripes bird animal text name pan-arab",
    "shortname": "eg",
    "name": "Egypt",
    "proportion": "2:3",
    "adopted": "1984",
    "symbolism": "Red: The Egyptians' blood in the war against colonization.<br>White: The purity of the Egyptian's heart.<br>Black below white: The manner in which darkness is overcome.<br>The Egyptian eagle of Saladin is centered in the white band. Saladin was a Sunni Kurd and the first sultan of Egypt and Syria and founder of the Ayyubid dynasty.<br>",
    "funfacts": "The development of the modern Egyptian flag was determined first by the Muhammad Ali Dynasty, under whom Egypt was united with Sudan, and later by the rise of Egyptian nationalism and revolutionary ideas among the Egyptian Army.<br>Egypt's Revolutionary and Liberation flag in 1952 was an inspiration to several Arab countries and was adopted by many Arab states. The same horizontal tricolour is used by <a href=\"?q=iraq\">Iraq</a>, <a href=\"?q=syria\">Syria</a>, <a href=\"?q=sudan\">Sudan</a>, and <a href=\"?q=yemen\">Yemen</a> (and formerly <a href=\"?q=libya\">Libya</a>), the only difference being the presence (or absence) of distinguishing national emblems in the white band.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Egypt"
  },
  {
    "tags": "western sahara black white green red triangle horizontal stripes moon star pan-arab",
    "shortname": "eh",
    "name": "Western Sahara",
    "proportion": "1:2",
    "adopted": "1976",
    "symbolism": "Red (Hashemite dynasty): Courage, bravery, hardiness, strength, and unity.<br>White (Umayyad dynasty): Cleanliness, honesty, peace, and purity.<br>Green (Fatimid dynasty): Prosperity, hope, joy, love, and optimism.<br>Black (Abbasid dynasty): Defeating enemies and strength of mind.<br>The star and crescent moon are considered symbols of Islam, and can be seen on flags of other neighbouring Islamic countries such as <a href=\"?q=algeria\">Algeria</a> and <a href=\"?q=mauritania\">Mauritania</a>.<br>",
    "funfacts": "Its design is based on that of the <a href=\"?q=palestine\">Palestinian flag</a>, which in turn was derived from the colors used in the Arab Revolt (referred to as the <a href=\"?q=pan-arab\">Pan-Arab</a> colours).<br>The flag is used in Polisario-controlled areas, while the Moroccan flag is used in the rest of the occupied territory.<br>It is said to be designed by El Uali Mustapha Sayed, the first president (1976).<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Western_Sahara"
  },
  {
    "tags": "eritrea green red blue yellow triangle pan-african",
    "shortname": "er",
    "name": "Eritrea",
    "proportion": "1:2",
    "adopted": "1995",
    "symbolism": "Green: The agriculture and livestock of the country.<br>Blue: The bounty of the sea.<br>Red: The blood shed in the struggle for Eritrean independence with the 30 leaves in the wreath representing the thirty years spent in the struggle.<br>",
    "funfacts": "The flag combines the basic layout and colours from the flag of the Eritrean People's Liberation Front with an emblem of a wreath with the upright olive branch derived from an earlier flag.<br>The shape of the red triangle broadly mimics the shape of the country.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Eritrea"
  },
  {
    "tags": "spain red yellow horizontal vertical stripes building crown ribbon waves animal vegetation cross fleur-de-lis text motto",
    "shortname": "es",
    "name": "Spain",
    "proportion": "2:3",
    "adopted": "1981",
    "symbolism": "The red and gold colours are traditional but have no official symbolic interpretation.<br>The shield of the coat of arms is divided into quarters, each representing the main kingdoms that eventually merged to form Spain (Castilla, Leon, Aragon and Navarra). At the bottom there's a pomegranate representing the kingdom of Granada.<br>The center contains <a href=\"?q=fleur-de-lis\">fleurs-de-lis</a> representing the House of Borbón (the current royal family).<br>Around the shield there's a ribbon with the Spanish <a href=\"?q=motto\">motto</a> \"Plus Ultra\" (\"Further Beyond\" in latin) wrapped around pillars representing Gibraltar.<br>On top of the shield and the pillars, there are royal crowns representing the Spanish Royal crown and the Imperial crown (Holy Roman empire) respectively.<br>",
    "funfacts": "At some point during the 1990s an unofficial version of the Spanish flag sporting an Osborne bull superimposed as some sort of \"coat of arms\" began appearing in football arenas. This usage has become increasingly popular and this flag is easily seen nowadays during sports events, football or others.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Spain"
  },
  {
    "tags": "ethiopia green yellow red blue triangle star circle horizontal stripes",
    "shortname": "et",
    "name": "Ethiopia",
    "proportion": "1:2",
    "adopted": "2009",
    "symbolism": "Red: The blood spilled in defence of Ethiopia.<br>Yellow: Peace and harmony between Ethiopia's various ethnic and religious groups.<br>Green: Hope, or the land and its fertility.<br>",
    "funfacts": "Upon gaining independence from colonial rule, several newly established countries in Africa adopted the same three colours in homage to Ethiopia's resistance against foreign occupation. When adopted by Pan-Africanist polities and organisations for their activities, the colours are often referred to as the <a href=\"?q=pan-african\">Pan-African</a> colours.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Ethiopia"
  },
  {
    "tags": "finland blue white cross",
    "shortname": "fi",
    "name": "Finland",
    "proportion": "11:18",
    "adopted": "1918",
    "symbolism": "Blue: The country's thousands of lakes and the sky.<br>White: The snow that covers the land in winter.<br>Cross: A Nordic <a href=\"?q=cross\">cross</a> which represents <a href=\"?q=christianity\">Christianity</a>.<br>",
    "funfacts": "Like <a href=\"?q=sweden\">Sweden</a>'s, Finland's national flag is based on the Nordic cross. It was adopted after independence from Russia, when many patriotic Finns wanted a special flag for their country, but its design dates back to the 19th century.<br>The current blue-crossed design was first used in Finland by Nyländska Jaktklubben, a yacht club founded in Helsinki in 1861.<br>As a special custom in Finland, the flag is flown at Midsummer from 6 pm of Midsummer eve until 9 pm of Midsummer's day. This is done to symbolize the fact that the darkness does not come to any part of Finland during Midsummer's Night.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Finland"
  },
  {
    "tags": "fiji blue white red cross british bird vegetation animal text ribbon weapon",
    "shortname": "fj",
    "name": "Fiji",
    "proportion": "1:2",
    "adopted": "1970",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Blue: The Pacific Ocean, which plays an important part in the lives of the islanders, both in terms of fishing industry and tourism.<br>Coat of arms: Dividing the shield quarterly is the Cross of St. George which together with the golden lion at the top represents United Kingdom, the former colonial power that ruled over Fiji.<br>The cacao pod held in the lion's paw, along with the sugarcane, coconut palm and bananas occupying three of the four quadrants, represent the country's natural resources and the dove represents peace.<br>",
    "funfacts": "While some reformists have called for the removal of the <a href=\"?q=united+kingdom\">Union Flag</a>, seeing it a British colonial emblem, others support its retention for the sake of historical continuity.<br>The flags of five other independent countries (<a href=\"?q=australia\">Australia</a>, <a href=\"?q=cook+islands\">Cook Islands</a>, <a href=\"?q=new+zealand\">New Zealand</a>, <a href=\"?q=niue\">Niue</a>, and <a href=\"?q=tuvalu\">Tuvalu</a>) retain the Union Flag in their national flags. But of these, only Fiji is a republic.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Fiji"
  },
  {
    "tags": "falkland islands blue white red cross british waves animal vegetation ribbon star text motto",
    "shortname": "fk",
    "name": "Falkland Islands",
    "proportion": "1:2",
    "adopted": "1999",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Coat of arms: The represents the Desire, the vessel in which the English sea-captain John Davis is reputed to have discovered the Falkland Islands in 1592. The <a href=\"?q=motto\">motto</a> \"Desire the Right\", also refers to the ship's name. The ram represents sheep farming, which until recently was the principal economic activity of the islands, and the tussock grass shows the most notable native vegetation.<br>",
    "funfacts": "The flag was banned by the Argentine military junta from April to June 1982, during their occupation of the islands, when it was replaced by the flag of Argentina.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Falkland_Islands"
  },
  {
    "tags": "micronesia blue white star",
    "shortname": "fm",
    "name": "Micronesia",
    "proportion": "10:19",
    "adopted": "1978",
    "symbolism": "Blue: The Pacific Ocean.<br>The four stars: The states in the federation: Chuuk, Pohnpei, Kosrae and Yap.<br>",
    "funfacts": "A similar design with six stars was in use from 1965 for the flag of the Trust Territory of the Pacific Islands. Kosrae was then part of Pohnpei so both were represented by one star. The three extra stars represented Palau, the Marshall Islands and Northern Mariana, which chose not to participate in the Federation.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Federated_States_of_Micronesia"
  },
  {
    "tags": "faroe islands white red blue cross",
    "shortname": "fo",
    "name": "Faroe Islands",
    "proportion": "8:11",
    "adopted": "1940",
    "symbolism": "Cross: A Nordic <a href=\"?q=cross\">cross</a> which represents <a href=\"?q=christianity\">Christianity</a>.<br>White: The creators of the flag, the foam of the sea and the pure, radiant sky of the Faroe Islands.<br>Blue and red: Other Scandinavian and nordic flags; representing the Faroe Islands' bonds with other Nordic countries.<br>",
    "funfacts": "On 25 April, 1940, the British occupation government approved the flag for use by Faroese vessels as Britain did not want the same flag as German-occupied Denmark to be used.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Faroe_Islands"
  },
  {
    "tags": "france blue white red vertical stripes",
    "shortname": "fr",
    "name": "France",
    "proportion": "2:3",
    "adopted": "1976",
    "symbolism": "Blue and red are the traditional colours of Paris, used on the city's coat of arms. Blue is identified with Saint Martin, red with Saint Denis.<br>White: The colour of the king.<br>The colours may also represent the three main estates of the Ancien Régime (the clergy, the nobility and the bourgeoisie).<br>",
    "funfacts": "The tricolour flag is derived from the cockade of France used during the French Revolution, which were circular rosette-like emblems attached to the hats.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_France"
  },
  {
    "tags": "gabon green yellow blue horizontal stripes",
    "shortname": "ga",
    "name": "Gabon",
    "proportion": "3:4",
    "adopted": "1960",
    "symbolism": "Green: The natural resources of Gabon, as well as its extensive forested area that the Gabonese people are economically dependent on in the form of lumber.<br>Yellow: The sun and also the Equator which cuts across the country.<br>Blue: The sea, specifically the South Atlantic Ocean along which the country has an extensive coast.<br>",
    "funfacts": "Unlike other former French colonies in <a href=\"?q=africa\">Africa</a>, the flag consists of a horizontal tricolour, rather than a vertical one modelled after the flag of <a href=\"?q=france\">France</a>.<br>The flag does not utilize the green, yellow and red colours of the <a href=\"?q=pan-african\">Pan-African</a> movement, in contrast to its neighbouring countries.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Gabon"
  },
  {
    "tags": "united kingdom great britain red white blue cross british",
    "shortname": "gb",
    "name": "United Kingdom",
    "proportion": "1:2",
    "adopted": "1801",
    "symbolism": "Red straight cross: The cross of Saint George, patron saint of England.<br>Red diagonal cross: The Cross of Saint Patrick, patron saint of Ireland.<br>Blue: The Saltire of Saint Andrew, patron saint of Scotland.<br>",
    "funfacts": "While the flag appears symmetric, the white lines above and below the diagonal red are different widths.<br>Wales is not represented in the Union Flag by Wales's patron saint (Saint David) but there are suggestions of adding the red Welsh dragon to the center of the flag.<br>The Police Service of Northern Ireland is the only body in the United Kingdom that is not permitted to fly the Union Flag, and is only permitted to fly its service flag or the Royal Standard in the event of a visit by the Sovereign.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_United_Kingdom"
  },
  {
    "tags": "england white red cross",
    "shortname": "gb-eng",
    "name": "England",
    "proportion": "3:5",
    "adopted": "1190",
    "symbolism": "The flag consists of the cross of Saint George, patron saint of England who is often depicted as a crusader.<br>",
    "funfacts": "The association of the red cross as an emblem of England can be traced back to the Late Middle Ages.<br>The cross was used as a component in the design of the <a href=\"?q=united+kingdom\">Union Jack</a> in 1606.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_England"
  },
  {
    "tags": "northern ireland white red cross star hand crown",
    "shortname": "gb-nir",
    "name": "Northern Ireland",
    "proportion": "1:2",
    "adopted": "1953",
    "symbolism": "Cross: De Burgh cross with origins in the First Crusade according to legends.<br>Crown: The monarchy of the <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Red hand: Rooted in Gaelic culture but its meaning is unknown.<br>Six pointed star: The six counties that make up Northern Ireland.<br>",
    "funfacts": "The only official flag in Northern Ireland is the Union Flag of the <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>The flag displayed above is called the Ulster Banner and is used by loyalists and unionists as well as to represent Northern Ireland internationally in some sporting competitions.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Ulster_Banner"
  },
  {
    "tags": "scotland blue white triangle cross diagonal",
    "shortname": "gb-sct",
    "name": "Scotland",
    "proportion": "3:5",
    "adopted": "1542",
    "symbolism": "The flag consists of the cross of Saint Andrew the patron saint of Scotland, an apostle of Jesus.<br>According to legend, the white cross appeared in the sky above a battle against the Angles.<br>",
    "funfacts": "When incorporated as part of the Union Flag during the 17th century, the dark blue applied to Union Flags destined for maritime use was possibly selected on the basis of the durability of darker dyes.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Scotland"
  },
  {
    "tags": "wales white green red animal horizontal stripes",
    "shortname": "gb-wls",
    "name": "Wales",
    "proportion": "3:5",
    "adopted": "1959",
    "symbolism": "The red dragon has been associated with Wales for centuries, though the origin of the adoption of the dragon symbol is now lost in history and myth.<br>The green and white stripes were additions by the House of Tudor, the Welsh dynasty that held the English throne from 1485 to 1603.<br>Green and white are also the colours of the leek, another national emblem of Wales.<br>",
    "funfacts": "The oldest known use of the dragon to represent Wales is from the Historia Brittonum, written around 830; the text describes a struggle between two serpents deep underground, which prevents King Vortigern from building a stronghold. This story was later adapted into a prophecy made by the wizard Myrddin (or Merlin) of a long fight between a red dragon and a white dragon. According to the prophecy, the white dragon, representing the Saxons, would at first dominate but eventually the red dragon, symbolising the Britons, would be victorious and recapture Lloegr.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Wales"
  },
  {
    "tags": "grenada red yellow green triangle vegetation star diagonal",
    "shortname": "gd",
    "name": "Grenada",
    "proportion": "3:5",
    "adopted": "1974",
    "symbolism": "Green: The islands' vegetation and agriculture.<br>Yellow: The sun as well as the warmth and wisdom of Grenadians.<br>Red: Harmony, unity, courage, and vitality.<br>Stars: The center star represents the capital, St. George's. The six stars on the border represents the country's six administrative divisions.<br>The symbol of a nutmeg at the side alludes to one of the primary agricultural exports of the islands.<br>",
    "funfacts": "Designed by a local Grenadian, it utilizes the colours of the <a href=\"?q=pan-african\">Pan-African</a> movement.<br>The country is the second-largest producer of nutmeg in the world, trailing only Indonesia. Consequently, Grenada has acquired the nicknames of \"Isle of Spice\" and \"Spice Island\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Grenada"
  },
  {
    "tags": "georgia white red cross",
    "shortname": "ge",
    "name": "Georgia",
    "proportion": "2:3",
    "adopted": "2004",
    "symbolism": "The large center cross of Saint George and the smaller Bolnisi crosses (officially \"bolnur-katskhuri\") are symbolic for <a href=\"?q=christianity\">Christianity</a>, more specifically Jesus and the four evangelists.<br>",
    "funfacts": "Originally a banner of the medieval Kingdom of Georgia, it was repopularized in the late 20th and early 21st centuries during the Georgian national revival.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Georgia_(country)"
  },
  {
    "tags": "french guiana green yellow red triangle star diagonal",
    "shortname": "gf",
    "name": "French Guiana",
    "proportion": "2:3",
    "adopted": "2010",
    "symbolism": "Green: The forest.<br>Yellow: The numerous underground resources.<br>Red star: The socialist orientation of the country.<br>",
    "funfacts": "The flag was originally the flag of the Guyanese Workers' Union (UTG) and later adopted by the General Council of French Guiana.<br>The official flag of French Guiana is the flag of <a href=\"?q=france\">France</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_French_Guiana"
  },
  {
    "tags": "guernsey white red yellow cross",
    "shortname": "gg",
    "name": "Guernsey",
    "proportion": "2:3",
    "adopted": "1985",
    "symbolism": "The red cross of Saint George, patron saint of England.<br>Gold Norman cross: William the Bastard, Duke of Normandy (who after the conquest became William I of England). William purportedly was given such a cross by Pope Alexander II and flew it on his standard in the Battle of Hastings.<br>",
    "funfacts": "Creation of the flag was prompted by confusion at international sporting events over competitors from Guernsey and <a href=\"?q=england\">England</a> using the same flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Guernsey"
  },
  {
    "tags": "ghana red yellow green black star horizontal stripe pan-african",
    "shortname": "gh",
    "name": "Ghana",
    "proportion": "2:3",
    "adopted": "1966",
    "symbolism": "Red: The blood of forefathers who led the struggle of independence and shared their blood through death.<br>Gold: The mineral resources mostly found in the Ashanti region of Ghana, helping to harness the wealth of the country.<br>Green: The rich forests and natural wealth that provides the nation with oil, food and cash crops, such as cocoa, timber and sheabutter.<br>The Black star of Africa: The emancipation of Africa and unity against colonialism. Also found in the flags of <a href=\"?q=guinea-bissau\">Guinea-Bissau</a> and <a href=\"?q=sao+tome+principe\">São Tomé and Príncipe</a>.<br>",
    "funfacts": "The Ghanaian flag was the second African flag after the flag of the <a href=\"?q=ethiopia\">Ethiopian</a> Empire to feature the colours of the <a href=\"?q=pan-african\">Pan-African</a> movement.<br>The flag's design influenced that of the flag of <a href=\"?q=guinea-bissau\">Guinea-Bissau</a>.<br>The nickname of the Ghanaian national football team is the \"Black Stars\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Ghana"
  },
  {
    "tags": "gibraltar white red horizontal stripes building",
    "shortname": "gi",
    "name": "Gibraltar",
    "proportion": "1:2",
    "adopted": "1982",
    "symbolism": "White: Peace and honesty.<br>Red: Hardiness, bravery, strength and valour.<br>Castle: The fortress of Gibraltar but without resemblance.<br>Key: The fortress' significance as Gibraltar was seen to be the key to Spain by the Moors and Spanish, and later as the key to the Mediterranean by the British.<br>",
    "funfacts": "Gibraltar is the only British Overseas Territory which does not feature the Union Flag in any form although it is widely flown as a stand alone flag within the territory.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Gibraltar"
  },
  {
    "tags": "greenland red white horizontal stripes circle",
    "shortname": "gl",
    "name": "Greenland",
    "proportion": "2:3",
    "adopted": "1989",
    "symbolism": "White stripe: The glaciers and ice cap, which cover more than 80% of the island.<br>Red stripe: The ocean.<br>Red semicircle: The sun, with its bottom part sunk in the ocean.<br>White semicircle: The icebergs and pack ice.<br>",
    "funfacts": "The flag of Greenland is the only national flag of a nordic country or territory without a Nordic <a href=\"?q=cross\">cross</a>.<br>In 1985 it was reported that Greenland's flag had exactly the same motif as the flag of a Danish rowing club, which was founded before Greenland's flag was chosen. It is not clear whether this is a case of plagiarism or just a coincidence, but the rowing club gave Greenland permission to use their flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Greenland"
  },
  {
    "tags": "gambia red white blue green horizontal stripes pan-african",
    "shortname": "gm",
    "name": "Gambia",
    "proportion": "2:3",
    "adopted": "1965",
    "symbolism": "Blue: The Gambia River, which is the nation's key feature and is where the country derives its name from.<br>Red: The sun as well as the savanna.<br>Green: The forest and the agricultural goods that the Gambian people are heavily dependent on, both for exports and their personal use.<br>White stripes: Unity and peace.<br>",
    "funfacts": "It was created by Louis Thomasi, who worked as an accountant.<br>The unofficial flag of planet Mars shares the same colours.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Gambia"
  },
  {
    "tags": "guinea red yellow green vertical stripes africa pan-african",
    "shortname": "gn",
    "name": "Guinea",
    "proportion": "2:3",
    "adopted": "1958",
    "symbolism": "Red: The blood of the martyrs who died from slavery and wars.<br>Yellow: The sun and the riches of the country.<br>Green: The country's vegetation.<br>",
    "funfacts": "The colours were derived from those of the flag of Ghana, following the <a href=\"?q=pan-african\">Pan-African</a> movement.<br>The flag is the reverse of the flag of <a href=\"?q=mali\">Mali</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Guinea"
  },
  {
    "tags": "guadeloupe blue black yellow sun fleur-de-lis horizontal stripes",
    "shortname": "gp",
    "name": "Guadeloupe",
    "proportion": "2:3",
    "adopted": "Unknown",
    "symbolism": "The unofficial flag of Guadeloupe is based on the coat of arms of the capital Basse-Terre and has either a black or red background.<br>Sun: The tropical climate.<br>Sugar cane: One of Guadeloupe's main crops.<br>Fleurs-de-lis: The belonging to France.<br>",
    "funfacts": "The official flag of Guadeloupe is the flag of <a href=\"?q=france\">France</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Guadeloupe"
  },
  {
    "tags": "equatorial guinea green white red blue triangle star text motto ribbon vegetation horizontal stripes",
    "shortname": "gq",
    "name": "Equatorial Guinea",
    "proportion": "2:3",
    "adopted": "1979",
    "symbolism": "Green: The natural resources, agriculture and jungles of the country.<br>Blue: The sea, which connects the main country with the islands.<br>White: Peace.<br>Red: The blood shed by the fighters for independence.<br>Coat of arms: The silk-cotton tree symbolizes the tree that the treaty with Spain was signed under, marking the beginning of the colonial rule. The six stars represent Rio Muni and the offshore islands. The ribbon has the national <a href=\"?q=motto\">motto</a> \"Unidad, Paz, Justicia\" (Unity, Peace, Justice).<br>",
    "funfacts": "Under the rule of dictator Francisco Nguema the flag was modified and a different national emblem was used in it (several tools, a sword and a chicken). After he was deposed the original flag was restored.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Equatorial_Guinea"
  },
  {
    "tags": "greece blue white cross horizontal stripes",
    "shortname": "gr",
    "name": "Greece",
    "proportion": "2:3",
    "adopted": "1978",
    "symbolism": "White and blue: The sky and sea.<br>Cross: Eastern Orthodox <a href=\"?q=christianity\">Christianity</a>, the prevailing religion of Greece.<br>",
    "funfacts": "According to popular tradition, the nine stripes represent the nine syllables of the phrase \"Ελευθερία ή Θάνατος\" (Freedom or Death).<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Greece"
  },
  {
    "tags": "south georgia blue white red cross british shield ribbon vegetation animal text motto",
    "shortname": "gs",
    "name": "South Georgia",
    "proportion": "1:2",
    "adopted": "1999",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Coat of arms: A golden lion holding a torch, representing the United Kingdom and discovery, together with two stars from the arms of James Cook who discovered the islands. The supporters are an Antarctic fur seal standing on a mountain, and a macaroni penguin standing on ice, both animal native to the islands. The crest is a reindeer, from the two herds of reindeer found on South Georgia Island.<br>",
    "funfacts": "The <a href=\"?q=motto\">motto</a> on the ribbon reads \"Leo Terram Propriam Protegat\" which is Latin for \"(Let the) Lion protect his own land\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_South_Georgia_and_the_South_Sandwich_Islands"
  },
  {
    "tags": "guatemala blue white vertical stripes weapon vegetation bird animal text motto ribbon",
    "shortname": "gt",
    "name": "Guatemala",
    "proportion": "5:8",
    "adopted": "1871",
    "symbolism": "Blue: Two stripes represent that Guatemala is located between two oceans, the Pacific Ocean and the Atlantic Ocean (Caribbean sea) as well as the sky over the country.<br>White: Peace and purity.<br>Coat of arms: The Quetzal is the national <a href=\"?q=bird\">bird</a> of Guatemala, and represents freedom and independence of the nation. The crossed Remington <a href=\"?q=weapon\">rifles</a> are the type used during the 1871 Liberal Revolution, and represent the will to defend Guatemala's interests. The crossed <a href=\"?q=weapon\">swords</a> represent justice and honor. The <a href=\"?q=laurel\">laurel</a> wreath represents victory.<br>",
    "funfacts": "The parchment at the center reads \"Libertad 15 de septiembre de 1821\" (Liberty 15 of September of 1821), the date Guatemala gained independence from <a href=\"?q=spain\">Spain</a>.<br>The blue and white colors, like those of several other countries in the <a href=\"?q=northa+blue+white\">region</a>, are based on the flag of the former Federal Republic of Central America.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Guatemala"
  },
  {
    "tags": "guinea-bissau yellow green red black star horizontal stripes pan-african",
    "shortname": "gw",
    "name": "Guinea-Bissau",
    "proportion": "1:2",
    "adopted": "1973",
    "symbolism": "Black star: The unity of <a href=\"?q=africa\">Africa</a>.<br>Red: The blood shed during the struggle for independence.<br>Yellow: The sun and mineral wealth.<br>Green: Hope and forests.<br>",
    "funfacts": "Like the former flag of <a href=\"?q=cape+verde\">Cape Verde</a>, the flag is based on that of the African Party for the Independence of Guinea and Cape Verde (PAIGC).<br>The PAIGC party flag was derived from that of <a href=\"?q=ghana\">Ghana</a>, which was the first design to use the <a href=\"?q=pan-african\">Pan-African</a> combination of red, yellow, green, and black in 1957.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Guinea-Bissau"
  },
  {
    "tags": "guam blue red vegetation boat weapon text name",
    "shortname": "gu",
    "name": "Guam",
    "proportion": "22:41",
    "adopted": "1948",
    "symbolism": "Red border: The blood that it ravaged in World War II and Spanish sovereignty.<br>Coat of arms: The shape is of the Chamorro sling stones used by the islanders' ancestors as <a href=\"?q=weapon\">weapons</a>. The coconut tree, growing in infertile sand, symbolizes self-sustenance and determination to grow and survive. The <a href=\"?q=boat\">boat</a> is a proa sailing in Agana Bay with the Ritidian Point in the background portraying the people's faithful commitment to passing their proud heritage, culture, and language to the endless sea of future generations.<br>",
    "funfacts": "The flag and emblem was designed by Helen L. Paul, the wife of a U.S. naval officer stationed in Guam.<br>The emblem says \"GUAM\" in bright red letters.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Guam"
  },
  {
    "tags": "guyana green white yellow black red triangle whitney_smith",
    "shortname": "gy",
    "name": "Guyana",
    "proportion": "3:5",
    "adopted": "1966",
    "symbolism": "Red: Zeal and dynamism.<br>Gold: Mineral wealth.<br>Green: Agriculture and forests.<br>Black: Endurance.<br>White: Rivers and water.<br>",
    "funfacts": "The flag was designed in part by vexillologist <a href=\"?q=whitney+smith\">Whitney Smith</a>, who coined the term Vexillology.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Guyana"
  },
  {
    "tags": "hong kong red white star vegetation",
    "shortname": "hk",
    "name": "Hong Kong",
    "proportion": "2:3",
    "adopted": "1997",
    "symbolism": "Red: A festive colour for the Chinese people, used to convey a sense of celebration and nationalism. Also signifies the link re-established between post-colonial Hong Kong and Mainland China.<br>Red and white: The principle of \"one country, two systems\".<br>Flower: The Hong Kong orchid tree flower, a flower discovered in Hong Kong, is meant to serve as a harmonizing symbol.<br>Stars: The five stars of the Chinese national flag are replicated on the petals of the flower.<br>",
    "funfacts": "The flag of Hong Kong was first officially hoisted on 1 July 1997, during the handover ceremony marking the transfer of sovereignty from Britain back to China.<br>Architect Tao Ho was in the panel who received design suggestions for the new flag, All six of the final designs were rejected by the PRC and Tao Ho ended up creating the accepted design.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Hong_Kong"
  },
  {
    "tags": "heard island and mcdonald islands blue white red cross british star",
    "shortname": "hm",
    "name": "Heard Island and McDonald Islands",
    "proportion": "1:2",
    "adopted": "1947",
    "symbolism": "For symbolism regarding the Australian flag, see <a href=\"?q=australia\">Australia</a>.<br>",
    "funfacts": "Heard Island and McDonald Islands is an uninhabited external territory of Australia in the southern Indian Ocean and is represented by the Australian flag.<br>Effective government, administration and control of Heard Island and the McDonald Islands was transferred from the United Kingdom to the Australian government in 1947 at the commencement of the first Australian National Antarctic Research Expedition (ANARE) to Heard Island.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Heard_Island_and_McDonald_Islands"
  },
  {
    "tags": "honduras blue white horizontal stripes star",
    "shortname": "hn",
    "name": "Honduras",
    "proportion": "1:2",
    "adopted": "1898",
    "symbolism": "Blue bands: The Pacific Ocean and the Caribbean Sea as well as the blue sky and brotherhood.<br>White band: The land between the ocean and the sea, the peace and prosperity of its people, and purity of thoughts.<br>Five stars: The five nations of the former Federal Republic of Central America (<a href=\"?q=el+salvador\">El Salvador</a>, <a href=\"?q=costa+rica\">Costa Rica</a>, <a href=\"?q=nicaragua\">Nicaragua</a>, Honduras, and <a href=\"?q=guatemala\">Guatemala</a>) and the hope that the nations may form a union again.<br>",
    "funfacts": "The blue and white colors, like those of several other countries in the <a href=\"?q=northa+blue+white\">region</a>, are based on the flag of the former Federal Republic of Central America.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Honduras"
  },
  {
    "tags": "croatia red white blue horizontal shield star moon stripes animal pan-slavic",
    "shortname": "hr",
    "name": "Croatia",
    "proportion": "1:2",
    "adopted": "1990",
    "symbolism": "The colours represent the three kingdoms; the Kingdom of Croatia (red and white), the Kingdom of Slavonia (blue and white) and partially the Kingdom of Dalmatia (blue and yellow).<br>Coat of arms: The chessboard pattern is thought to be of medieval origin but its symbolism is unknown. The smaller shields above is representing the five regions of Croatia; Croatia, Dubrovnik, Dalmatia, Istria and Slavonia.<br>",
    "funfacts": "Unlike in many countries, Croatian design more commonly uses symbolism from the coat of arms, rather than from the Croatian flag. Partly because the <a href=\"?q=pan-slavic\">Pan-Slavic</a> colors are present in many <a href=\"?q=europe\">European</a> flags.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Croatia"
  },
  {
    "tags": "haiti blue red white horizontal stripes vegetation weapon hat text motto ribbon flag",
    "shortname": "ht",
    "name": "Haiti",
    "proportion": "3:5",
    "adopted": "1986",
    "symbolism": "Blue: The black citizens of Haiti.<br>Red: The people of colour (mulatto).<br>Coat of arms: A trophy of <a href=\"?q=weapon\">weapons</a> atop a green hill and a royal palm symbolizing independence. Above the palm tree, there is a Phrygian cap placed as a symbol of freedom.<br>",
    "funfacts": "The ribbon says \"L'Union fait la force\" (Unity Makes Strength) which is the national <a href=\"?q=motto\">motto</a>.<br>The newly appointed revolutionary leader Jean-Jacques Dessalines created the flag by taking a <a href=\"?q=france\">French tricolor</a> and ripping out the white center, which he discarded. He then asked Catherine Flon, his god-daughter, to sew the remaining bands together.<br>The flag is one of the few whose design incorporate a depiction of the flag itself.<br>It was discovered at the 1936 Summer Olympics in Berlin that Haiti and <a href=\"?q=liechtenstein\">Liechtenstein</a> were using the same flag. This led to the addition of a crown to the design of the flag of Liechtenstein.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Haiti"
  },
  {
    "tags": "hungary red white green horizontal stripes",
    "shortname": "hu",
    "name": "Hungary",
    "proportion": "1:2",
    "adopted": "1990",
    "symbolism": "Red: Strength and the blood spilled for the fatherland.<br>White: Faithfulness and freedom.<br>Green: Hope and the pastures of Hungary.<br>",
    "funfacts": "The modern flag of Hungary originated from the national freedom movement from before 1848 and features a tricolour element, which is based upon the <a href=\"?q=france\">French flag</a>, as a reflection of the ideas of the French revolution.<br>The stripes are horizontal rather than vertical to prevent confusion with the <a href=\"?q=italy\">Italian flag</a> despite the banner in that form predating the Italian tricolour by at least 7 years.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Hungary"
  },
  {
    "tags": "indonesia red white horizontal stripes",
    "shortname": "id",
    "name": "Indonesia",
    "proportion": "2:3",
    "adopted": "1950",
    "symbolism": "Red: Courage and the human body or physical life.<br>White: Purity and the soul or spiritual life.<br>",
    "funfacts": "The origin of red and white can be traced back to the older common Austronesian mythology of the duality of Mother Earth (red) and Father Sky (white).<br>After Indonesia's independence was recognized, <a href=\"?q=monaco\">Monaco</a> (which have a nearly identical flag) filed a complaint which was largely ignored.<br>Red and white textile colouring was available in ancient Indonesia. White is the natural colour of woven cotton fabrics, while red is one of the earliest natural dyes, acquired either from teak leaves, the flowers of Averrhoa bilimbi, or the skin of mangosteen fruits.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Indonesia"
  },
  {
    "tags": "ireland green white orange vertical stripes",
    "shortname": "ie",
    "name": "Ireland",
    "proportion": "1:2",
    "adopted": "1916",
    "symbolism": "Green: Roman Catholics.<br>Orange: The minority Protestants who were supporters of William of Orange.<br>White: A lasting peace and hope for union between Protestants and Catholics in Ireland.<br>",
    "funfacts": "The oldest known reference to the use of the three colours of green, white and orange as a nationalist emblem dates from September 1830 when tricolour cockades were worn at a meeting held to celebrate the <a href=\"?q=france\">French</a> Revolution of that year.<br>The <a href=\"?q=ivory+coast\">Ivorian flag</a> has a similar colour layout to the flag of the Irish flag, but with the orange on the hoist side and a shorter proportion (2:3 instead of 1:2). Due to this similarity, in Northern Ireland, Ulster loyalists have sometimes desecrated the Ivorian flag, mistaking it for the Irish one.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Ireland"
  },
  {
    "tags": "israel white blue triangle horizontal stripes star",
    "shortname": "il",
    "name": "Israel",
    "proportion": "8:11",
    "adopted": "1948",
    "symbolism": "Blue: God's glory, purity and severity.<br>White: Divine benevolence.<br>Star: The Star of David, a generally recognized symbol of modern Jewish identity and Judaism.<br>The basic design recalls the Tallit, the Jewish prayer shawl, which is white with black or blue stripes.<br>",
    "funfacts": "The flag was designed for the Zionist Movement in 1891.<br>The Star of David was not considered an exclusively Jewish symbol until after it began to be used on the gravestones of fallen Jewish soldiers in World War I.<br>Palestinians including Yasser Arafat and Hamas have claimed that the two blue stripes on the Israeli flag represent the Nile and Euphrates rivers and allege that Israel desires to eventually seize all the land in between.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Israel"
  },
  {
    "tags": "isle of man red white yellow star",
    "shortname": "im",
    "name": "Isle of Man",
    "proportion": "1:2",
    "adopted": "1932",
    "symbolism": "The three legs is called a triskelion but its symbolism and origin is unknown.<br>According to Norse mythology, the triskelion was a symbol of the movement of the sun through the heavens.<br>",
    "funfacts": "The usage of a triskelion was very popular with Scandinavian cultures, and the symbol may have been introduced to the Isle by the Norse descendants of King Amlaíb Cuarán, who ruled the island between the 10th century and 1266.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Isle_of_Man"
  },
  {
    "tags": "india orange white green blue horizontal stripes circle",
    "shortname": "in",
    "name": "India",
    "proportion": "2:3",
    "adopted": "1947",
    "symbolism": "Orange (saffron): Courage and sacrifice.<br>White: Peace and truth.<br>Green: Faith and chivalry.<br>Wheel: The Ashoka Chakra representing the eternal wheel of law as well as movement and change.<br>",
    "funfacts": "By law, the flag is to be made of khadi, a special type of hand-spun cloth or silk, made popular by Mahatma Gandhi.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_India"
  },
  {
    "tags": "british indian ocean territory blue red white cross crown waves vegetation",
    "shortname": "io",
    "name": "British Indian Ocean Territory",
    "proportion": "1:2",
    "adopted": "1990",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Waves: The Indian Ocean, where the islands are located.<br>Palm tree and St Edward's <a href=\"?q=crown\">Crown</a> are symbols of the Indian Ocean Territory.<br>",
    "funfacts": "Given that it is impossible for civilians to visit the British Indian Ocean Territory, it is not clear how widely this flag is used.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_British_Indian_Ocean_Territory"
  },
  {
    "tags": "iraq red white black green horizontal stripes text motto pan-arab",
    "shortname": "iq",
    "name": "Iraq",
    "proportion": "2:3",
    "adopted": "2008",
    "symbolism": "Red (Hashemite dynasty): Courage, bravery, hardiness, strength, and unity.<br>White (Umayyad dynasty): Cleanliness, honesty, peace, and purity.<br>Green (Fatimid dynasty): Prosperity, hope, joy, love, and optimism.<br>Black (Abbasid dynasty): Defeating enemies and strength of mind.<br>",
    "funfacts": "The text is the takbīr, the phrase \"Allahu akbar\" meaning \"God is the greatest\" in Arabic.<br>The colors are those used in the Arab Revolt and referred to as the <a href=\"?q=pan-arab\">Pan-Arab</a> colours.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Iraq"
  },
  {
    "tags": "iran green white red text motto horizontal stripes",
    "shortname": "ir",
    "name": "Iran",
    "proportion": "4:7",
    "adopted": "1980",
    "symbolism": "Green: Growth, happiness, unity, nature, vitality and the Iranian languages.<br>White: Freedom.<br>Red: Bravery, fire, life, love, warmth, and sophistication.<br>Emblem: Geometrically symmetric form of the word \"Allah\", meaning \"God\" in Arabic.<br>",
    "funfacts": "The takbir, the phrase \"Allahu akbar\" meaning \"God is the greatest\" in Arabic, is written 11 times in Kufic script.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Iran"
  },
  {
    "tags": "iceland blue red white cross",
    "shortname": "is",
    "name": "Iceland",
    "proportion": "18:25",
    "adopted": "1944",
    "symbolism": "Cross: A Nordic <a href=\"?q=cross\">cross</a> which represents <a href=\"?q=christianity\">Christianity</a>.<br>Red: The fire produced by the island's volcanoes.<br>White: The ice and snow that covers Iceland<br>Blue: The mountains of the island.<br>",
    "funfacts": "According to a legend described in Andrew Evans' Iceland, a red cloth with a white cross fell from the heavens, ensuring <a href=\"?q=denmark\">Danish</a> victory at the Battle of Valdemar in the 13th century. Denmark then used the cross on its flag throughout its nordic territories as a sign of divine right. Upon Iceland's independence, they continued to use the <a href=\"?q=christianity\">Christian</a> symbol.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Iceland"
  },
  {
    "tags": "italy green white red vertical stripes",
    "shortname": "it",
    "name": "Italy",
    "proportion": "2:3",
    "adopted": "1946",
    "symbolism": "Green: Natural rights; social equality and freedom. Alternatively the meadows and the Mediterranean maquis.<br>White: The snow of the Alps.<br>Red: The blood spilt in the Wars of Italian Independence and Unification.<br>",
    "funfacts": "The Italian tricolour, like other tricolour flags, is inspired by the <a href=\"?q=france\">French</a> one, introduced by the revolution in the autumn of 1790 on French Navy warships, and symbol of the renewal perpetrated by the origins of Jacobinism.<br>The Italian gazettes at the time of the French revolution had created confusion about the replacement of green with blue and red, reporting the news that the French tricolour was green, white and red. When the correct information on the French tricolour arrived in Italy, the Italian Jacobins decided to keep green instead of blue.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Italy"
  },
  {
    "tags": "jersey white red triangle cross animal crown diagonal",
    "shortname": "je",
    "name": "Jersey",
    "proportion": "3:5",
    "adopted": "1981",
    "symbolism": "Red cross: The Cross of Saint Patrick, patron saint of <a href=\"?q=ireland\">Ireland</a>.<br>Crown: Attributed to the house of Plantagenet and indicates the islands loyalty to that dynasty.<br>Lions: Derived from the seal granted to the island's bailiff by Edward I in 1279.<br>",
    "funfacts": "The flag was used to signal the neutrality of the Channel Islands during wars between <a href=\"?q=england\">England</a> and <a href=\"?q=france\">France</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Jersey"
  },
  {
    "tags": "jamaica green yellow black triangle cross diagonal",
    "shortname": "jm",
    "name": "Jamaica",
    "proportion": "1:2",
    "adopted": "1962",
    "symbolism": "Black: The strength and creativity of the people which has allowed them to overcome difficulties.<br>Yellow: The wealth of the country and the golden sunshine.<br>Green: The lush vegetation of the island, as well as hope.<br>",
    "funfacts": "The only national flag that does not contain a shade of the colors red, white, or blue.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Jamaica"
  },
  {
    "tags": "jordan black white green red triangle horizontal stripes star pan-arab",
    "shortname": "jo",
    "name": "Jordan",
    "proportion": "1:2",
    "adopted": "1928",
    "symbolism": "Red (Hashemite dynasty): Courage, bravery, hardiness, strength, and unity.<br>White (Umayyad dynasty): Cleanliness, honesty, peace, and purity.<br>Green (Fatimid dynasty): Prosperity, hope, joy, love, and optimism.<br>Black (Abbasid dynasty): Defeating enemies and strength of mind.<br>The star: The unity of the Arab people. Its seven-pointed star refers to the seven verses of Al-Fatiha and possibly also the faith in one God, humanity, humility, national spirit, virtue, social justice, and aspiration.<br>",
    "funfacts": "The colors are those used in the Arab Revolt and referred to as the <a href=\"?q=pan-arab\">Pan-Arab</a> colours.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Jordan"
  },
  {
    "tags": "japan white red circle sun",
    "shortname": "jp",
    "name": "Japan",
    "proportion": "2:3",
    "adopted": "1999",
    "symbolism": "Since ancient times, the sun has been a symbol of national unity because of the close relationship between national rule and the <a href=\"?q=sun\">sun</a>.<br>",
    "funfacts": "The flag is commonly known in Japan as \"Hinomaru\" (日の丸, the \"circle of the sun\").<br>The sun is closely related to the Imperial family, as legend states the imperial throne was descended from the sun goddess Amaterasu.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Japan"
  },
  {
    "tags": "kenya black white red green weapon shield horizontal stripes pan-african",
    "shortname": "ke",
    "name": "Kenya",
    "proportion": "2:3",
    "adopted": "1963",
    "symbolism": "Black: The people of the Republic of Kenya.<br>Red: The blood shed during the fight for independence.<br>Green: The country's landscape and natural wealth.<br>White: Peace and honesty.<br>Maasai shield and spears: The defense of things mentioned above.<br>",
    "funfacts": "The flag is based on that of Kenya African National Union and the colors of the <a href=\"?q=pan-african\">Pan-African</a> movement.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Kenya"
  },
  {
    "tags": "kyrgyzstan red yellow sun circle building",
    "shortname": "kg",
    "name": "Kyrgyzstan",
    "proportion": "3:5",
    "adopted": "1992",
    "symbolism": "Red: Bravery and valor and alludes to the emblem hoisted by Manas, the national hero of Kyrgyzstan.<br>Sun: Peace and prosperity, while its 40 rays stand for the number of tribes united by Manas to fight against the Mongols.<br>Center: The opening in the center of the roof of a yurt (traditional tent) which symbolizes the origin of life, the unity of time and space, as well as the people's hearth and home.<br>",
    "funfacts": "The center of the flag is a depiction of the first thing one sees when waking up in a yurt, namely the construction of the pinnacle of every Kyrgyz yurt with three crisscrossing laths across the circular opening at the top of the yurt.<br>Modern-day Kyrgyzstan has sizeable minority groups such as the Uzbeks and Dungans. These groups were historically conquered by Manas, and hence, the current flag does not sit well with some of them.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Kyrgyzstan"
  },
  {
    "tags": "cambodia blue red white horizontal stripes building",
    "shortname": "kh",
    "name": "Cambodia",
    "proportion": "16:25",
    "adopted": "1993",
    "symbolism": "Angkor Wat: Integrity, justice and heritage.<br>Blue: Liberty, cooperation and brotherhood.<br>Red: Bravery.<br>",
    "funfacts": "Since around 1850, the Cambodian flag has featured a depiction of Angkor Wat in the centre.<br>The flag is one of only a few flags to feature a <a href=\"?q=building\">building</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Cambodia"
  },
  {
    "tags": "kiribati red white blue yellow sun bird animal waves",
    "shortname": "ki",
    "name": "Kiribati",
    "proportion": "1:2",
    "adopted": "1979",
    "symbolism": "Three white waves: The Pacific Ocean and the three archipelagoes (Gilbert, Phoenix and Line Islands).<br>The sun and its 17 rays: Kiribati's position on the equator and the 16 Gilbert Islands and Banaba.<br>Frigatebird: Command over the sea, freedom, and dance patterns.<br>",
    "funfacts": "The badge was designed by Sir Arthur Grimble in 1931 for the Gilbert and Ellice Islands British colony.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Kiribati"
  },
  {
    "tags": "comoros green yellow white red blue triangle horizontal stripes moon star pan-african",
    "shortname": "km",
    "name": "Comoros",
    "proportion": "3:5",
    "adopted": "2001",
    "symbolism": "Stripes and stars: The four islands of the nation; yellow is for Mohéli, white is for <a href=\"?q=mayotte\">Mayotte</a> (claimed by Comoros but administered by <a href=\"?q=france\">France</a>), red is for Anjouan, and blue is for Grande Comore.<br>Star, moon and green: The main religion, Islam.<br>",
    "funfacts": "In its constitution, the government of the Comoros refers to the insignia as \"l'emblème national\", or the \"national emblem\", though it is understood to actually represent a flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Comoros"
  },
  {
    "tags": "saint kitts nevis green yellow black white red triangle star stripes diagonal",
    "shortname": "kn",
    "name": "Saint Kitts and Nevis",
    "proportion": "2:3",
    "adopted": "1983",
    "symbolism": "Green: The fertile land.<br>Red: The fight for freedom against slavery and colonialism.<br>Yellow: The sunshine the islands enjoy all year round.<br>Black: The people's African origins.<br>The two stars: Hope and liberty.<br>",
    "funfacts": "Although the flag utilises the colours of the <a href=\"?q=pan-african\">Pan-Africanist</a> movement, the symbolism behind them is interpreted differently. <br>A national competition was held in the early 1980s to choose a new flag. The winning design by student Edris Lewis was one of 258 entries.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Saint_Kitts_and_Nevis"
  },
  {
    "tags": "north korea blue white red horizontal stripes star circle",
    "shortname": "kp",
    "name": "North Korea",
    "proportion": "1:2",
    "adopted": "1948",
    "symbolism": "Red star: Revolutionary traditions but is also a universal symbol of Communism and socialism.<br>Red: The patriotism and determination of the Korean people.<br>White: The unity of the Korean nation and its culture.<br>Blue: The desire to fight for independence, peace, friendship, and international unity.<br>",
    "funfacts": "The flag is banned from public use in South Korea due to its association with the ruling North Korean regime, although some exceptions for the usage of the flag exist.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_North_Korea"
  },
  {
    "tags": "south korea white black red blue circle stripes",
    "shortname": "kr",
    "name": "South Korea",
    "proportion": "2:3",
    "adopted": "2011",
    "symbolism": "White: Peace and purity, a traditional color in Korean culture.<br>Circle (taegeuk): Balance in the universe; the red half represents positive cosmic forces, and the blue half represents the opposing negative cosmic forces.<br>The trigrams: Movement and harmony as fundamental principles. Each trigram represents one of the four classical elements.<br>",
    "funfacts": "The South Korean flag is considered by a large part of the country's citizens to represent the \"Korean race\" rather than solely the South Korean state; consequently flag desecration by the country's citizens is rare when compared to other countries.<br>The taegeuk is used in Korean Shamanism, Confucianism, Daoism and Buddhism.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_South_Korea"
  },
  {
    "tags": "kuwait green white red black horizontal stripes pan-arab",
    "shortname": "kw",
    "name": "Kuwait",
    "proportion": "1:2",
    "adopted": "1961",
    "symbolism": "Red (Hashemite dynasty): Courage, bravery, hardiness, strength, and unity.<br>White (Umayyad dynasty): Cleanliness, honesty, peace, and purity.<br>Green (Fatimid dynasty): Prosperity, hope, joy, love, and optimism.<br>Black (Abbasid dynasty): Defeating enemies and strength of mind.<br>",
    "funfacts": "The colors are those used in the Arab Revolt and referred to as the <a href=\"?q=pan-arab\">Pan-Arab</a> colours.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Kuwait"
  },
  {
    "tags": "cayman islands white blue red cross british text star animal waves",
    "shortname": "ky",
    "name": "Cayman Islands",
    "proportion": "1:2",
    "adopted": "1999",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Three green stars: The three inhabited Islands; Grand Cayman, Little Cayman and Cayman Brac.<br>Gold lion: Britain.<br>Turtle: The Caymans' seafaring history.<br>The rope: Traditional thatch-rope industry.<br>Pineapple: Jamaica.<br>",
    "funfacts": "The islands' motto, \"He hath founded it upon the seas\", is printed at the bottom of the shield. This line, a verse from Psalm 24 Verse 2, acknowledges the Caymans' Christian heritage, as well as its ties to the sea.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Cayman_Islands"
  },
  {
    "tags": "kazakhstan blue yellow circle sun bird animal",
    "shortname": "kz",
    "name": "Kazakhstan",
    "proportion": "1:2",
    "adopted": "1992",
    "symbolism": "Blue: The peace, freedom, cultural, and ethnic unity of Kazakh people including the various Turkic people that make up the present-day population.<br>Sun: A source of life and energy. It is also a symbol of wealth and abundance; the sun's rays are a symbol of the steppe's grain which is the basis of abundance and prosperity.<br>Eagle: Independence, freedom and flight to the future.<br>Pattern: A national ornamental pattern called \"koshkar-muiz\" (the horns of the ram).<br>",
    "funfacts": "Probably inspired by the <a href=\"?q=belarus\">Belarus</a> flag created when flags of distinctive designs were first being developed for the Soviet Union republics.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Kazakhstan"
  },
  {
    "tags": "laos red blue white horizontal stripes circle",
    "shortname": "la",
    "name": "Laos",
    "proportion": "2:3",
    "adopted": "1975",
    "symbolism": "White disk: The unity of the Lao people and a full moon against the Mekong River.<br>Red: The blood shed by the Lao people on both banks of the Mekong River in their struggle for freedom and independence from the French.<br>Blue: The Mekong River itself, a symbol of the nation's prosperity.<br>",
    "funfacts": "It is one of the three flags of a currently communist country (the others being <a href=\"?q=cuba\">Cuba</a> and <a href=\"?q=nepal\">Nepal</a>) that does not use any <a href=\"?q=communist\">communist</a> symbolism.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Laos"
  },
  {
    "tags": "lebanon red white green horizontal stripes vegetation",
    "shortname": "lb",
    "name": "Lebanon",
    "proportion": "2:3",
    "adopted": "1943",
    "symbolism": "Cedar tree: Inspired by the mountains of Lebanon cedar (Cedrus libani). The Cedar is also a symbol of Maronite Christians and has its origin in many biblical references.<br>White: The snow as a symbol of purity and peace.<br>Red: The Lebanese blood shed to preserve the country against the successive invaders.<br>",
    "funfacts": "It was adopted just prior to independence from France in 1943. Seeking independence, the actual flag was first drawn by member of parliament Henri Pharaon.<br>The cedar of Lebanon is mentioned 77 times in the Bible, especially in the book Psalms chapter 92 verse 13 where it says that \"The righteous shall flourish like the palm tree, He shall grow like a cedar in Lebanon\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Lebanon"
  },
  {
    "tags": "saint lucia blue white black yellow mountain triangle",
    "shortname": "lc",
    "name": "Saint Lucia",
    "proportion": "1:2",
    "adopted": "2002",
    "symbolism": "Blue: The sky and the sea, specifically the Atlantic Ocean and Caribbean Sea.<br>Black and white: The harmonious relationship between the black and white races.<br>Yellow: The sunshine and prosperity.<br>Triangles: Unity and the Pitons, which are twin volcanic cones located in the southwest part of the island.<br>",
    "funfacts": "The Pitons (Gros Piton and Petit Piton) are a national symbol of Saint Lucia.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Saint_Lucia"
  },
  {
    "tags": "liechtenstein blue red yellow horizontal stripes crown",
    "shortname": "li",
    "name": "Liechtenstein",
    "proportion": "3:5",
    "adopted": "1982",
    "symbolism": "Blue: The sky.<br>Red: The \"evening fires\" that are lit inside houses throughout the country.<br>Crown: The unity of the people and their prince.<br>",
    "funfacts": "The <a href=\"?q=crown\">crown</a> was added to the flag in 1937 after the country found out, at the Summer Olympics held the previous year, that their flag was identical to the civil flag of <a href=\"?q=haiti\">Haiti</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Liechtenstein"
  },
  {
    "tags": "sri lanka yellow green orange red maroon vertical stripes animal weapon vegetation",
    "shortname": "lk",
    "name": "Sri Lanka",
    "proportion": "1:2",
    "adopted": "1972",
    "symbolism": "The lion and the maroon: The Sinhala ethnicity.<br>Yellow border and four bo leaves: The concepts of mettā, karuṇā, muditā and upekshā respectively.<br>Stripes: The country's two largest minorities; orange for Tamils and green for Muslims (Moors).<br>There are more details with its own symbolism, the full list can be found by following the Wikipedia link below.<br>",
    "funfacts": "The symbol of a lion in Sri Lankan heraldry dates back to 486 BC, when Vijaya, the first King of Sri Lanka, arrived on the island from <a href=\"?q=india\">India</a> and brought with him a standard depicting a lion.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Sri_Lanka"
  },
  {
    "tags": "liberia red white blue horizontal stripes star",
    "shortname": "lr",
    "name": "Liberia",
    "proportion": "10:19",
    "adopted": "1847",
    "symbolism": "Eleven stripes: The signatories of the Liberian Declaration of Independence.<br>Red and white: Courage and moral excellence.<br>White star: The first independent republic in Africa.<br>Blue square: The African continent.<br>",
    "funfacts": "The Liberian flag is modeled after and resembles the United States flag because Liberia was founded, colonized, established, and controlled by free people of color and formerly enslaved black people from the <a href=\"?q=united+states\">United States</a> and the Caribbean.<br>Since Liberia offers registration under its flag, shipping companies registers boats as Liberian to avoid taxes and restrictions that other countries enforce. It is the second most popular flag of convenience after the flag of <a href=\"?q=panama\">Panama</a>.<br>The only nation other than <a href=\"?q=ethiopia\">Ethiopia</a> to remain independent during the Scramble for Africa.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Liberia"
  },
  {
    "tags": "lesotho blue white green hat horizontal stripes",
    "shortname": "ls",
    "name": "Lesotho",
    "proportion": "2:3",
    "adopted": "2006",
    "symbolism": "Blue: The sky or rain.<br>White: Peace.<br>Green: Prosperity.<br>Black Basotho hat: The native people of Lesotho and the black people of the nation.<br>",
    "funfacts": "The design is intended to reflect a state that is at peace both internally and with its only neighbour <a href=\"?q=south+africa\">South Africa</a>.<br>Lesotho has had the ideology of peace since the ages of King Moshoeshoe I (1822-1870).<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Lesotho"
  },
  {
    "tags": "lithuania yellow green red horizontal stripes",
    "shortname": "lt",
    "name": "Lithuania",
    "proportion": "3:5",
    "adopted": "2004",
    "symbolism": "Yellow: The sun and prosperity.<br>Green: The forests, the countryside, liberty, and hope.<br>Red: The blood and bravery of those who have died for Lithuania.<br>",
    "funfacts": "It is not known who originally suggested the yellow, green, and red colors, but the idea is usually attributed to Lithuanian exiles living elsewhere in <a href=\"?q=europe\">Europe</a> or in the <a href=\"?q=united+states\">United States</a> during the 19th century. These three colors were frequently used in folk weavings and traditional dresses.<br>Under the National Flag Law, the state flag is permanently hoisted at three locations: the Royal Palace of Lithuania, Trakai Island Castle, and the grounds of the Vytautas the Great War Museum in Kaunas.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Lithuania"
  },
  {
    "tags": "luxembourg red white blue horizontal stripes",
    "shortname": "lu",
    "name": "Luxembourg",
    "proportion": "3:5",
    "adopted": "1993",
    "symbolism": "Red: Revolution and power, as well as determination and courage of the people.<br>White: Harmony, peace and innocence of the people.<br>Blue: Perseverance and determination.<br>",
    "funfacts": "It is almost identical to the flag of the <a href=\"?q=netherlands\">Netherlands</a>, except that it is longer and its light blue stripe and red stripe are a lighter shade. But there is no documented relationship between the flags.<br>Luxembourg had no flag until 1830, during the Belgian Revolution, when patriots were urged to display the national colours.<br>The red, white, and light blue colours were derived from the coat of arms of the House of Luxembourg.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Luxembourg"
  },
  {
    "tags": "latvia red white horizontal stripes",
    "shortname": "lv",
    "name": "Latvia",
    "proportion": "1:2",
    "adopted": "1990",
    "symbolism": "Red: The readiness of the Latvians to give the blood from their hearts for freedom and their willingness to defend their liberty.<br>",
    "funfacts": "An alternative interpretation, according to one legend, is that a Latvian leader was wounded in battle, and the edges of the white sheet in which he was wrapped were stained by his blood. This story is similar to the legend of the origins of the flag of <a href=\"?q=austria\">Austria</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Latvia"
  },
  {
    "tags": "libya red black green white horizontal stripes star moon pan-arab",
    "shortname": "ly",
    "name": "Libya",
    "proportion": "1:2",
    "adopted": "2011",
    "symbolism": "Red: The blood sacrificed for the freedom of Libya.<br>Black: The dark days that Libyans lived under the occupation of the Italians.<br>Green: Primary wealth, agriculture and the future prosperity of the country.<br>Crescent moon: The beginning of the lunar month according to the Muslim calendar, meant as a reminder of the migration story of the Prophet Mohammed to spread Islam and its teachings.<br>Star: Hope, the beauty of aim and the light of the belief in God and the country.<br>",
    "funfacts": "The colors are those used in the Arab Revolt and referred to as the <a href=\"?q=pan-arab\">Pan-Arab</a> colours.<br>Under Muammar Gaddafi's rule, Libya had a red-white-black flag from 1969 to 1977, and it was replaced by the all-green flag from 1977 to 2011, during which it was the only flag in the world to have one color and no design.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Libya"
  },
  {
    "tags": "morocco red green star triangle",
    "shortname": "ma",
    "name": "Morocco",
    "proportion": "2:3",
    "adopted": "1915",
    "symbolism": "Red: Hardiness, bravery, strength and valour.<br>Green: Love, joy, wisdom, peace and hope as well as the color of <a href=\"?q=islam\">Islam</a>.<br>Pentagram: The seal of Solomon and the five branches represent the pillars of Islam or alternatively; love, truth, peace, freedom and justice.<br>",
    "funfacts": "Red has considerable historic significance in Morocco, proclaiming the descent from royal Alaouite dynasty. This ruling house was associated with the Islamic prophet Muhammad via Fatimah, the wife of Ali, the fourth Muslim Caliph.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Morocco"
  },
  {
    "tags": "monaco red white horizontal stripes",
    "shortname": "mc",
    "name": "Monaco",
    "proportion": "4:5",
    "adopted": "1881",
    "symbolism": "Red: The flesh of the human body.<br>White: Purity in spiritual life.<br>",
    "funfacts": "The flag of Monaco is nearly identical to the flag of <a href=\"?q=indonesia\">Indonesia</a> but it is believed to be purely coincidental.<br>The flag of <a href=\"?q=poland\">Poland</a> is also similar to that of Monaco, but with the colours reversed.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Monaco"
  },
  {
    "tags": "moldova blue yellow red vertical stripes star moon bird animal shield cross vegetation",
    "shortname": "md",
    "name": "Moldova",
    "proportion": "1:2",
    "adopted": "1990",
    "symbolism": "Blue: Liberty.<br>Yellow: Justice.<br>Red: Fraternity.<br>The eagle holds a Christian Orthodox cross, olive branch (peace) and a shield with traditional Moldovan symbols like the auroch and rose.<br>",
    "funfacts": "It is very similar to the flag of <a href=\"?q=romania\">Romania</a>, reflecting the two countries' national and cultural affinity.<br>The design is also similar to the flags of <a href=\"?q=andorra\">Andorra</a> and <a href=\"?q=chad\">Chad</a> but that is believed to be coincidental.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Moldova"
  },
  {
    "tags": "montenegro red yellow bird cross animal",
    "shortname": "me",
    "name": "Montenegro",
    "proportion": "1:2",
    "adopted": "2004",
    "symbolism": "Two-headed eagle: Unity or close connections between state and church.<br>",
    "funfacts": "Montenegro previously had the widest flag in the world at a ratio of 1:3.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Montenegro"
  },
  {
    "tags": "saint martin blue white red vertical stripes",
    "shortname": "mf",
    "name": "Saint Martin",
    "proportion": "2:3",
    "adopted": "1794",
    "symbolism": "For symbolism regarding the French flag, see <a href=\"?q=france\">France</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Collectivity_of_Saint_Martin"
  },
  {
    "tags": "madagascar white red green horizontal stripes",
    "shortname": "mg",
    "name": "Madagascar",
    "proportion": "2:3",
    "adopted": "1958",
    "symbolism": "Red and white: The colors of the Merina kingdom.<br>Green: The color of the Hova, the largest class of peasant commoners, who played a significant role in anti-French agitation and the independence movement.<br>",
    "funfacts": "The flag was adopted two years before the independence from <a href=\"?q=france\">France</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Madagascar"
  },
  {
    "tags": "marshall islands blue white orange stripes triangle star sun diagonal",
    "shortname": "mh",
    "name": "Marshall Islands",
    "proportion": "10:19",
    "adopted": "1979",
    "symbolism": "Blue: The pacific ocean.<br>Orange and white stripes: The equator, sunrise and sunset, as well as peace and courage.<br>Star: The country's location as a Northern Hemisphere archipelago and its 24 points represent the number of electoral districts, while the four elongated points represent the principal cultural centers of Majuro, Jaluit, Wotje and Ebeye.<br>",
    "funfacts": "Designed by Emlain Kabua, who served as the first First Lady of the republic.<br>It is the national flag with the most points on a star, at 24.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Marshall_Islands"
  },
  {
    "tags": "north macedonia red yellow sun triangle circle diagonal",
    "shortname": "mk",
    "name": "North Macedonia",
    "proportion": "1:2",
    "adopted": "1995",
    "symbolism": "The sun represents the \"new sun of Liberty\" referred to in \"Denes nad Makedonija\", the national anthem of North Macedonia.<br>",
    "funfacts": "The previous flag featured the \"Vergina Sun\" but <a href=\"?q=greece\">Greece</a> considers the Vergina Sun to be a Greek symbol and imposed a year-long economic embargo in order to force the then Republic of Macedonia to remove it from its flag, resulting in the current design.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_North_Macedonia"
  },
  {
    "tags": "mali green yellow red vertical stripes pan-african",
    "shortname": "ml",
    "name": "Mali",
    "proportion": "2:3",
    "adopted": "1961",
    "symbolism": "Green: Fertility of the land.<br>Gold: Purity and mineral wealth.<br>Red: The blood shed for independence from the French.<br>",
    "funfacts": "The colours were derived from those of the flag of <a href=\"?q=ghana\">Ghana</a>, following the <a href=\"?q=pan-african\">Pan-African</a> movement.<br>The flag is the reverse of the flag of <a href=\"?q=guinea\">Guinea</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Mali"
  },
  {
    "tags": "myanmar burma red green yellow white star horizontal stripes",
    "shortname": "mm",
    "name": "Myanmar",
    "proportion": "2:3",
    "adopted": "2010",
    "symbolism": "Yellow: Solidarity.<br>Green: Peace, tranquility and lush greenery.<br>Red: Courage and determination.<br>White star: The significance of the union of the country.<br>",
    "funfacts": "Green, yellow, and red are also considered <a href=\"?q=pan-african\">Pan-African</a> colours, leading commentators to note that the new flag looked distinctly \"African\" and even that it was being confused for the flag of an African country.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Myanmar"
  },
  {
    "tags": "mongolia red blue yellow vertical stripes circle",
    "shortname": "mn",
    "name": "Mongolia",
    "proportion": "1:2",
    "adopted": "1992",
    "symbolism": "Blue: The eternal blue sky.<br>Red: Thriving for eternity.<br>Soyombo symbol: Fire, sun, moon, earth, water, and the Taijitu symbol representing the duality of yin and yang.<br>",
    "funfacts": "The Soyombo symbol is a special character in the Soyombo alphabet invented by Zanabazar in 1686. It serves as a national symbol of Mongolia, to be found on the Flag of Mongolia, the Emblem of Mongolia, and on many other official documents.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Mongolia"
  },
  {
    "tags": "macau green white star horizontal stripes vegetation waves",
    "shortname": "mo",
    "name": "Macau",
    "proportion": "2:3",
    "adopted": "1999",
    "symbolism": "Stars: Referencing the flag of People's Republic of <a href=\"?q=china\">China</a>, symbolising the relationship Macau has with its sovereign state.<br>Lotus: The floral emblem of Macau.<br>Bridge: One of the most recognisable landmarks for the territory, The Governor Nobre de Carvalho Bridge linking the Macau Peninsula and the island of Taipa.<br>Water: Macau's position as a port and its role played in the territory.<br>",
    "funfacts": "Prior to the handover of Macau to the People's Republic of <a href=\"?q=china\">China</a> by the <a href=\"?q=portugal\">Portuguese</a> Republic in 1999, Macau officially used only the Portuguese flag, in contrast to <a href=\"?q=hong+kong\">Hong Kong</a>, which, under <a href=\"?q=united+kingdom\">British</a> rule, used a defaced Blue Ensign as its flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Macau"
  },
  {
    "tags": "northern mariana islands blue white grey circle star",
    "shortname": "mp",
    "name": "Northern Mariana Islands",
    "proportion": "1:2",
    "adopted": "1985",
    "symbolism": "Star: The United States.<br>Latte stone: The Chamorros, the indigenous people of the Mariana Islands.<br>Mwarmwar: a decorative wreath representing the Carolinians.<br>Blue: The Pacific Ocean and the Mariana Trench.<br>",
    "funfacts": "A latte stone is a pillar (up to 5 meters tall) capped by a hemispherical stone capital with the flat side facing up. Used as building supports by the ancient Chamorro people.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Northern_Mariana_Islands"
  },
  {
    "tags": "martinique green red black triangle horizontal",
    "shortname": "mq",
    "name": "Martinique",
    "proportion": "2:3",
    "adopted": "2023",
    "symbolism": "The Martiniquais independence movement.<br>",
    "funfacts": "Known as the \"Rouge-vert-noir\" (\"red-green-black\").<br>The flag was the runner-up in the official competition of finding an official flag of Martinique but eventually won after the winner was withdrawn after plagiarism accusations.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Martinique"
  },
  {
    "tags": "mauritania green yellow star moon horizontal stripes pan-african",
    "shortname": "mr",
    "name": "Mauritania",
    "proportion": "2:3",
    "adopted": "2017",
    "symbolism": "Green, star and crescent moon: Islam, Mauritania's state religion.<br>Yellow: The sands of the Sahara desert.<br>Red: The efforts and sacrifices that the people of Mauritania will keep consenting, to the price of their blood, to defend their territory.<br>",
    "funfacts": "Although the flag utilises the colours of the <a href=\"?q=pan-african\">Pan-Africanist</a> movement, the symbolism behind them is interpreted differently. <br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Mauritania"
  },
  {
    "tags": "montserrat blue white red cross british human",
    "shortname": "ms",
    "name": "Montserrat",
    "proportion": "1:2",
    "adopted": "1999",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Person with harp: Éirinn, the female personification of <a href=\"?q=ireland\">Ireland</a>, with a golden harp which is also symbol of Ireland.<br>",
    "funfacts": "The Irish symbolism of the flag is due to the nation's Irish ancestry.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Montserrat"
  },
  {
    "tags": "malta red white vertical stripes cross animal text",
    "shortname": "mt",
    "name": "Malta",
    "proportion": "2:3",
    "adopted": "1964",
    "symbolism": "Red and white most likely represents the flag of the Knights of Malta, a white cross on a red field.<br>George cross: It was awarded to the island of Malta by King George VI so as to \"bear witness to the heroism and devotion of its people\" during the great siege they underwent in the early part of World War II and was incorporated into the flag in 1943.<br>",
    "funfacts": "A popular myth of its origin is that Roger I of Sicily tore off part of his chequered red-and-white flag to give to the local Christians fighting with him so they could be recognized against the Arabic defenders.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Malta"
  },
  {
    "tags": "mauritius red blue yellow green horizontal stripes pan-african",
    "shortname": "mu",
    "name": "Mauritius",
    "proportion": "2:3",
    "adopted": "1968",
    "symbolism": "Red: The struggle for freedom and independence.<br>Blue: The Indian Ocean, in which Mauritius is situated.<br>Yellow: The new light of independence.<br>Green: The agriculture of Mauritius and its colour throughout the 12 months of the year.<br>",
    "funfacts": "In an attempt to unite the nation, especially following the deadly and divisive 1965 Mauritius race riots and 1968 Mauritian riots, the colours also represent the main political parties at the time.<br>Although the flag utilises the colours of the <a href=\"?q=pan-african\">Pan-Africanist</a> movement, the symbolism behind them is interpreted differently.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Mauritius"
  },
  {
    "tags": "maldives red green white moon",
    "shortname": "mv",
    "name": "Maldives",
    "proportion": "2:3",
    "adopted": "1965",
    "symbolism": "Red: The boldness of the nation's heroes, and their willingness to sacrifice their every drop of blood in defense of their country.<br>Green: Peace and prosperity.<br>White crescent moon: The Islamic faith of the state and authorities.<br>",
    "funfacts": "Designed by Abdul Majeed Didi, Sultan of the Maldives from 1944 to 1952 and has been described as \"the father of the modern Maldives\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Maldives"
  },
  {
    "tags": "malawi black red green horizontal stripes sun pan-african",
    "shortname": "mw",
    "name": "Malawi",
    "proportion": "2:3",
    "adopted": "2012",
    "symbolism": "Rising sun: The dawn of hope and freedom for the continent of Africa (when the flag was created, more countries in Africa were gaining independence from European rule).<br>31 rays of the sun: The fact that Malawi was the 31st African nation at the time of its independence.<br>Black: The indigenous people of the continent.<br>Red: The blood of their struggle.<br>Green: Nature.<br>",
    "funfacts": "It resembles the Pan-African flag designed by Marcus Garvey's Universal Negro Improvement Association and a version of it (with a full white sun) was adopted by Malawi in 2010 through endorsement of the Malawi president Bingu wa Mutharika. The decision was reverted in 2012 since a majority of the population saw it as an illegitimate flag, perceiving its adoption as undemocratic.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Malawi"
  },
  {
    "tags": "mexico green white red vertical stripes bird animal vegetation ribbon flag",
    "shortname": "mx",
    "name": "Mexico",
    "proportion": "4:7",
    "adopted": "1968",
    "symbolism": "Coat of arms: Based on the Aztec symbol for Tenochtitlan (now Mexico City), the center of the Aztec empire.<br>Colors: First used in Mexico by the Army of the Three Guarantees, in the end of the Mexican War of Independence against Spain, fighting for the three decrees it was meant to defend; religion, independence and unity.<br>",
    "funfacts": "It is very similar to the <a href=\"?q=italy\">Italian</a> flag, with a slight difference in the shades and proportion.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Mexico"
  },
  {
    "tags": "malaysia blue red white yellow horizontal stripes moon star",
    "shortname": "my",
    "name": "Malaysia",
    "proportion": "1:2",
    "adopted": "1963",
    "symbolism": "The 14 stripes: The equal status in the federation of the 13 member states and the federal territories.<br>Blue: The unity of the Malaysian people.<br>14-point star (Federal Star): The unity between the states and territories.<br>The crescent moon: Islam, the country's state religion.<br>Yellow: The royal colour of the Malay rulers.<br>",
    "funfacts": "The design of the flag is based on those of two existing flags, the flag of Majapahit and the flag of Johor, where the stripes from the flag of Majapahit were incorporated together with the canton containing the crescent moon and star from the flag of Johor.<br>The Federal Star is similar in concept of <a href=\"?q=australia\">Australia</a>'s Commonwealth Star in that it symbolises the unity of states in the Malaysian federation and its Federal government.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Malaysia"
  },
  {
    "tags": "mozambique green white black yellow red triangle horizontal stripes star weapon tool pan-african",
    "shortname": "mz",
    "name": "Mozambique",
    "proportion": "2:3",
    "adopted": "1983",
    "symbolism": "Green: The riches of the land.<br>White: Peace.<br>Black: The African continent.<br>Yellow: The country's minerals.<br>Red: The struggle for independence.<br>Coat of arms: The rifle represents defence and vigilance. The open book represents the importance of education. The hoe represents the country's agriculture. The star represents Marxism and internationalism.<br>",
    "funfacts": "It is one of the few national flags among UN member states that feature a firearm, along with those of <a href=\"?q=guatemala\">Guatemala</a> and <a href=\"?q=haiti\">Haiti</a>.<br>The flag is based on the flag of the Mozambican Liberation Front (FRELIMO), the leading political party in Mozambique.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Mozambique"
  },
  {
    "tags": "namibia blue white red green yellow triangle sun circle stripes pan-african diagonal",
    "shortname": "na",
    "name": "Namibia",
    "proportion": "2:3",
    "adopted": "1990",
    "symbolism": "Red: The country's most important resource, its people, and their heroism as well as determination to build a future of equal opportunity for all.<br>White: Peace, unity, tranquility, and harmony.<br>Green: Vegetation and agricultural resources.<br>Blue: The clear Namibian sky and the Atlantic Ocean, the country's precious water resources and rain.<br>Sun: Life and energy.<br>",
    "funfacts": "Designed by Fred Brownell (South African state herald) who also designed the flag of <a href=\"?q=south+africa\">South Africa</a>.<br>It was adopted on 21 March 1990 upon independence from <a href=\"?q=south+africa\">South Africa</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Namibia"
  },
  {
    "tags": "new caledonia blue red green yellow black horizontal stripes circle sun",
    "shortname": "nc",
    "name": "New Caledonia",
    "proportion": "2:3",
    "adopted": "1794",
    "symbolism": "Blue: The sky and more importantly the ocean surrounding New Caledonia.<br>Red: The blood shed by the Kanaks in their struggle for independence, socialism, and unity.<br>Green: The land itself and by extension the ancestors buried within it.<br>Yellow disc: The sun and the symbol upon it consists of a flèche faitière, a carved rooftop spire that adorns Kanak houses and represents the spirit of Kanak culture.<br>",
    "funfacts": "It is also the flag of the Kanak and Socialist National Liberation Front (FLNKS), a political party favoring independence for New Caledonia (an overseas territory of <a href=\"?q=france\">France</a>), thus a highly controversial emblem.<br>Two flags represent New Caledonia, the Kanak flag (pictured above) and the flag of France.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flags_of_New_Caledonia"
  },
  {
    "tags": "niger orange white green horizontal stripes circle",
    "shortname": "ne",
    "name": "Niger",
    "proportion": "6:7",
    "adopted": "1959",
    "symbolism": "Orange stripe: The northern regions of the Sahara Desert.<br>White: Purity and the French-descended small white minority.<br>Green: Hope and the fertile regions of southern Niger.<br>Orange circle: The sun and independence.<br>",
    "funfacts": "It is similar to the Flag of <a href=\"?q=india\">India</a>, although the ratio, shade of orange, and symbol in the center differ.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Niger"
  },
  {
    "tags": "norfolk island green white vertical stripes vegetation",
    "shortname": "nf",
    "name": "Norfolk Island",
    "proportion": "1:2",
    "adopted": "1979",
    "symbolism": "Norfolk Island pine: Endemic to Norfolk Island and hence an important symbol.<br>",
    "funfacts": "It is similar to the flag of <a href=\"?q=nigeria\">Nigeria</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Norfolk_Island"
  },
  {
    "tags": "nigeria green white vertical stripes",
    "shortname": "ng",
    "name": "Nigeria",
    "proportion": "1:2",
    "adopted": "1960",
    "symbolism": "Green: Natural wealth.<br>White: Peace and unity.<br>",
    "funfacts": "The flag is an adaptation of the winning entry from Michael Taiwo Akinkunmi (23-year-old student in London at the time) in a competition held in 1959.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Nigeria"
  },
  {
    "tags": "nicaragua blue white horizontal stripes mountain waves hat text name",
    "shortname": "ni",
    "name": "Nicaragua",
    "proportion": "3:5",
    "adopted": "1971",
    "symbolism": "Triangle: Equality.<br>Five volcanoes: The original member states of the Federal Republic of Central America (<a href=\"?q=costa+rica\">Costa Rica</a>, <a href=\"?q=el+salvador\">El Salvador</a>, <a href=\"?q=guatemala\">Guatemala</a>, <a href=\"?q=honduras\">Honduras</a>, and Nicaragua).<br>Phrygian cap of Liberty: National freedom.<br>Rays of the sun and the rainbow: The bright future to come.<br>",
    "funfacts": "It is based and inspired on the flag of the Federal Republic of Central America and flag of <a href=\"?q=argentina\">Argentina</a>.<br>The presence of a rainbow in the coat of arms makes the flag of Nicaragua one of only two flags of a sovereign state to include the color purple, alongside the flag of <a href=\"?q=dominica\">Dominica</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Nicaragua"
  },
  {
    "tags": "netherlands red white blue horizontal stripes",
    "shortname": "nl",
    "name": "Netherlands",
    "proportion": "2:3",
    "adopted": "1937",
    "symbolism": "Red: Bravery, strength and valor.<br>White: Honesty and peace.<br>Blue: Loyalty, justice and vigilance.<br>",
    "funfacts": "Based on the Prince's Flag which is based on the Flag of Prince William of Orange-Nassau.<br>The previously orange stripe was replaced by red because orange was more likely to fade out at the time.<br>The flag of Netherlands is probably the oldest tricolour flag in continuous use and inspired the <a href=\"?q=russia\">Russian</a> and <a href=\"?q=france\">French</a> flags.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Netherlands"
  },
  {
    "tags": "norway blue red white cross",
    "shortname": "no",
    "name": "Norway",
    "proportion": "8:11",
    "adopted": "1821",
    "symbolism": "Cross: Christianity.<br>Red and blue: <a href=\"?q=denmark\">Denmark</a> and <a href=\"?q=sweden\">Sweden</a> respectively, the former and present union partners.<br>",
    "funfacts": "It was designed in 1821 by Fredrik Meltzer, a member of the parliament.<br>In 1844, a union mark combining Norwegian and <a href=\"?q=sweden\">Swedish</a> colours was placed at the hoist of both countries' flags. The badge was jokingly called Sildesalaten (\"the herring salad\") because of its jumble of colours and resemblance to a popular dish on the breakfast tables of both countries.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Norway"
  },
  {
    "tags": "nepal red blue white triangle star sun moon",
    "shortname": "np",
    "name": "Nepal",
    "proportion": "It's complicated.",
    "adopted": "1962",
    "symbolism": "Red: The bravery of Nepali people and it also represents the color of the rhododendron, Nepal's national flower.<br>Blue: Peace.<br>Moon: The cool weather of the Himalayas and the calm demeanor and purity of spirit of the Nepali people.<br>Sun: The heat and the high temperature of the southern lowlands (Terai) and the Nepali peoples fierce resolve.<br>",
    "funfacts": "Until 1962, the flag's emblems, both the sun and the crescent moon, had human faces, but they were removed to modernize the flag.<br>It is one of the three flags of a currently communist country that does not use any <a href=\"?q=communist\">communist</a> symbolism (the others being <a href=\"?q=cuba\">Cuba</a> and <a href=\"?q=laos\">Laos</a>).<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Nepal"
  },
  {
    "tags": "nauru blue yellow white horizontal stripes star",
    "shortname": "nr",
    "name": "Nauru",
    "proportion": "1:2",
    "adopted": "1968",
    "symbolism": "Blue: The Pacific Ocean.<br>Gold stripe: The Equator.<br>Stripe and star: The location of the island in the Pacific Ocean just south of the Equator.<br>Twelve points on the star: The island's twelve original tribes.<br>White: The phosphate which was a major natural resource of the island nation.<br>",
    "funfacts": "Some believe that the separation into two equal parts recalls the saga that the first inhabitants were to have been brought to Earth from two boulders.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Nauru"
  },
  {
    "tags": "niue yellow blue white red cross british circle star",
    "shortname": "nu",
    "name": "Niue",
    "proportion": "1:2",
    "adopted": "1975",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Union Jack: The protection granted by the United Kingdom in 1900.<br>Yellow: The bright sunshine of Niue and the warm feelings of the Niuean people towards New Zealand and her people.<br>Four small stars: The Southern Cross constellation represents <a href=\"?q=new+zealand\">New Zealand</a>, which took over responsibility and administration of Niue in 1901.<br>Blue disc with large star: The deep blue sea surrounding the self-governing island of Niue.<br>",
    "funfacts": "It is very unusual for a flag based on a <a href=\"?q=british\">British</a> ensign design, in having not only a yellow background, but also an edited Union Jack.<br>It was designed by Patricia Rex, the wife of the first Premier of the island; Robert Rex.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Niue"
  },
  {
    "tags": "new zealand blue white red cross british star",
    "shortname": "nz",
    "name": "New Zealand",
    "proportion": "1:2",
    "adopted": "1902",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Four red stars: The Southern Cross constellation.<br>",
    "funfacts": "In Māori mythology the Southern Cross is identified as \"Māhutonga\", an aperture in Te Ikaroa (the Milky Way) through which storm winds escaped.<br>Replacing the flag with a new one has been a continouous debate in the country since 1973. In the last referendum about it (2016) the country voted to keep the existing flag by 57% to 43%.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_New_Zealand"
  },
  {
    "tags": "oman red white green weapon horizontal",
    "shortname": "om",
    "name": "Oman",
    "proportion": "1:2",
    "adopted": "1995",
    "symbolism": "White: Peace and the Imam, the religious leader of Oman.<br>Green: The Jabal al-Akdar, or \"Green Mountains,\" which lie toward the north of the country.<br>Red: Referencing other Gulf state flags.<br>Swords and dagger: The historic weapons utilized by the people of Oman.<br>",
    "funfacts": "The dagger (khanjar) itself is a national symbol of the sultanate, and is still worn by Omani men as a \"ceremonial dagger\" for formal occasions.<br>Under a Royal Decree issued in 2004, the Ministry of Commerce and Industry is required to give authorization before any merchandise is allowed to depict the national emblem.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Oman"
  },
  {
    "tags": "panama white red blue horizontal vertical star",
    "shortname": "pa",
    "name": "Panama",
    "proportion": "2:3",
    "adopted": "1925",
    "symbolism": "Blue: The Conservative Party.<br>Red: The Liberal Party.<br>White: Peace and purity.<br>Stars: Blue for the purity and honesty of the life of the country, red for the authority and law. Together the stars stand for the new republic.<br>",
    "funfacts": "Designed by María de la Ossa de Amador, known as \"Mother of the Nation\", which was the First Lady of Panama from 1904 to 1908 and a member of the separatist movment which fought for Panamanian independence from <a href=\"?q=colombia\">Colombia</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Panama"
  },
  {
    "tags": "peru red white vertical stripes",
    "shortname": "pe",
    "name": "Peru",
    "proportion": "2:3",
    "adopted": "1950",
    "symbolism": "Red: The blood that was spilled for the fight.<br>White: Purity and Peace.<br>",
    "funfacts": "The current colors of the Peruvian flag were taken of the design of San Martín (known as \"El Libertador of Argentina, Chile and Peru\") and Torre Tagle (fifth President of Peru from 1823 to 1824).<br>The colors red and white are believed to be inspired by the colors of red-and-white flamingos or alternatively red from the flag of <a href=\"?q=chile\">Chile</a> and white from the flag of <a href=\"?q=argentina\">Argentina</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Peru"
  },
  {
    "tags": "french polynesia red white horizontal stripes waves circle star boat",
    "shortname": "pf",
    "name": "French Polynesia",
    "proportion": "2:3",
    "adopted": "1984",
    "symbolism": "Red and white: Traditional Polynesian colours.<br>Canoe: A Tahitian and national traditional symbol.<br>Five asterisks: The five Archipelagos (the Society Islands, the Tuamotus archipelago, the Gambier Islands, the Austral Islands and the Marquesas).<br>",
    "funfacts": "All vessels registered in French Polynesia have to fly the <a href=\"?q=france\">French</a> flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_French_Polynesia"
  },
  {
    "tags": "papua new guinea red black yellow white triangle star bird animal diagonal",
    "shortname": "pg",
    "name": "Papua New Guinea",
    "proportion": "3:4",
    "adopted": "1971",
    "symbolism": "Red and black: Traditional colours of many Papua New Guinean tribes as well as the colours of the German Empire who colonised the country prior to 1918.<br>Bird-of-paradise: Traditional national symbol.<br>Five stars: The Southern Cross constellation.<br>",
    "funfacts": "The design was chosen through a nationwide design competition in 1971. The winning designer was Susan Karike, who was 15 at the time but went largely unrecognised during her lifetime.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Papua_New_Guinea"
  },
  {
    "tags": "philippines blue red white yellow triangle horizontal stripes circle sun star",
    "shortname": "ph",
    "name": "Philippines",
    "proportion": "1:2",
    "adopted": "1998",
    "symbolism": "Blue: Peace, truth, and justice.<br>Red: Patriotism and valor.<br>White triangle: Liberty, equality, and fraternity.<br>Sun: Unity, freedom, people's democracy and sovereignty.<br>Eight rays of the sun: Each represents a province with significant involvement in the 1896 Philippine Revolution against Spain.<br>Three stars: The main three island groups (Luzon, Visayas and Mindanao).<br>",
    "funfacts": "A unique feature of this flag is its usage to indicate a state of war if it is displayed with the red side on top.<br>According to the 1898 Proclamation of Philippine Independence document, the white triangle signifies the emblem of the Katipunan, the secret society that opposed <a href=\"?q=spain\">Spanish</a> rule. It also says the flag's colors commemorate the flag of the <a href=\"?q=united+states\">United States</a> as a manifestation of gratitude for American aid against the Spanish during the Philippine Revolution.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Philippines"
  },
  {
    "tags": "pakistan green white vertical stripes moon star",
    "shortname": "pk",
    "name": "Pakistan",
    "proportion": "2:3",
    "adopted": "1947",
    "symbolism": "Green: The Muslim-majority population.<br>White: The various religious minorities, such as Hindus, Christians, Sikhs, Zoroastrians and others.<br>Crescent moon and star: Islam, with the crescent moon representing progress and the five-pointed star representing light and knowledge.<br>",
    "funfacts": "The flag of Pakistan traces its current form back to a meeting of the Constituent Assembly of Pakistan in 1947, three days before the Partition of British <a href=\"?q=india\">India</a>, when it was adopted by the All-India Muslim League as the official flag-to-be of the Dominion of Pakistan.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Pakistan"
  },
  {
    "tags": "poland white red horizontal stripes",
    "shortname": "pl",
    "name": "Poland",
    "proportion": "5:8",
    "adopted": "1919",
    "symbolism": "Red and white: The colours of the coats of arms of the two constituent nations of the Polish-Lithuanian Commonwealth, i.e. the White Eagle of Poland and the Pursuer of the Grand Duchy of Lithuania.<br>",
    "funfacts": "Similar but unrelated flags are those of <a href=\"?q=indonesia\">Indonesia</a> and <a href=\"?q=monaco\">Monaco</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Poland"
  },
  {
    "tags": "saint pierre and miquelon white blue green yellow red black triangle cross boat waves animal",
    "shortname": "pm",
    "name": "Saint Pierre and Miquelon",
    "proportion": "2:3",
    "adopted": "1982",
    "symbolism": "Ship: Said to be Grande Hermine, which brought Jacques Cartier to Saint Pierre in 1536.<br>Three square fields: The origin of most inhabitants of the islands, Basques, Bretons, and Normans.<br>",
    "funfacts": "The official flag of Saint Pierre and Miquelon is the flag of <a href=\"?q=france\">France</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Saint_Pierre_and_Miquelon"
  },
  {
    "tags": "pitcairn islands blue white red yellow green cross vegetation ribbon british",
    "shortname": "pn",
    "name": "Pitcairn Islands",
    "proportion": "REPLACE",
    "adopted": "1984",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Shield with anchor and Bible: The ancestral history of the islanders, most of whom are descended from the sailors who mutinied on the HMS Bounty in 1789.<br>Green and blue: The island rising from the ocean.<br>",
    "funfacts": "Knight helmet, Pitcairn island wheelbarrow and flowering portia tree is of unknown symbolism.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_and_coat_of_arms_of_the_Pitcairn_Islands"
  },
  {
    "tags": "puerto rico red white blue triangle horizontal stripes star",
    "shortname": "pr",
    "name": "Puerto Rico",
    "proportion": "2:3",
    "adopted": "1952",
    "symbolism": "Red: The blood from the brave warriors.<br>White stripes: The victory and peace that they would have after gaining independence.<br>Triangle: The three branches of government.<br>White star: The island of Puerto Rico.<br>Blue: The sky and coastal waters.<br>",
    "funfacts": "The design was according to some, the result of an optical illusion that Antonio Vélez Alvarado (Puerto Rican journalist, politician and revolutionary) saw in his Manhattan apartment in 1892. He stared at a Cuban flag for a few minutes and after looking at the blank wall the illusion made him perceive the image of the <a href=\"?q=cuba\">Cuban</a> flag with the colors of the triangle and stripes inverted.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Puerto_Rico"
  },
  {
    "tags": "palestine red white green black triangle horizontal stripes pan-arab",
    "shortname": "ps",
    "name": "Palestine",
    "proportion": "1:2",
    "adopted": "1988",
    "symbolism": "Red (Hashemite dynasty): Courage, bravery, hardiness, strength, and unity.<br>White (Umayyad dynasty): Cleanliness, honesty, peace, and purity.<br>Green (Fatimid dynasty): Prosperity, hope, joy, love, and optimism.<br>Black (Abbasid dynasty): Defeating enemies and strength of mind.<br>",
    "funfacts": "The colors are those used in the Arab Revolt and referred to as the <a href=\"?q=pan-arab\">Pan-Arab</a> colours.<br>Very similar to the flags of <a href=\"?q=jordan\">Jordan</a> and <a href=\"?q=western+sahara\">Western Sahara</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Palestine"
  },
  {
    "tags": "portugal green red vertical stripes circle sphere building shield",
    "shortname": "pt",
    "name": "Portugal",
    "proportion": "2:3",
    "adopted": "1911",
    "symbolism": "Green: The hope of the nation.<br>Red: The blood of those who died defending it.<br>Yellow circle: The armillary sphere, an astronomical and navigational instrument used by the Portuguese sailors.<br>Shield: Five small blue shields representing the five wounds of Christ while the seven castles refers to the Portuguese victories over their Moorish enemies, under Afonso III, who supposedly captured seven enemy fortresses in the course of his conquest of the Algarve.<br>",
    "funfacts": "The red and green colors were not traditionally Portuguese until after the Republican revolution in 1910. The colours were associated with the Portuguese Republican Party and its associated movements. Before that, the portuguese colors were white and blue from the blue cross-on-white banner of King Afonso I.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Portugal"
  },
  {
    "tags": "palau blue yellow circle sun moon",
    "shortname": "pw",
    "name": "Palau",
    "proportion": "5:8",
    "adopted": "1981",
    "symbolism": "Blue: The Pacific Ocean and the nation's place within it, and also the transition from foreign domination to self-government.<br>Yellow disc: The full moon which the Palauans consider to be the optimum time for human activity. It is also a symbol of peace, love, and tranquility.<br>",
    "funfacts": "While there are some speculations about the flag paying tribute to the <a href=\"?q=japan\">Japanese</a> flag and the Palauan-Japanese relations, this has been denied by the designer John Blau Skebong.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Palau"
  },
  {
    "tags": "paraguay red white blue horizontal stripes circle star vegetation text name",
    "shortname": "py",
    "name": "Paraguay",
    "proportion": "11:20",
    "adopted": "2013",
    "symbolism": "Inspired by the colours of the <a href=\"?q=france\">French</a> Tricolour, believed to signify independence and liberty.<br>Front side emblem is the National coat of arms and says \"Republica del Paraguay\", Spanish for \"Republic of Paraguay\".<br>Reverse side emblem is the Seal of treasury and says \"Paz y Justicia\", Spanish for \"Peace and Justice\".<br>",
    "funfacts": "The flag is unusual because it differs on its front and reverse sides; the front of the flag shows the national coat of arms, and the reverse shows the seal of the treasury.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Paraguay"
  },
  {
    "tags": "qatar white maroon purple triangle tool",
    "shortname": "qa",
    "name": "Qatar",
    "proportion": "11:28",
    "adopted": "1971",
    "symbolism": "Serrated edge: The nine white points signify Qatar's inclusion as the 9th member of the 'reconciled Emirates' of the Persian Gulf at the conclusion of the Qatari-British treaty in 1916.<br>Maroon: The history of purple dye in the country dates back several centuries and when the <a href=\"?q=united+kingdom\">British</a> suggested red for an official flag of the nation the Qatari government rejected it and used a mixture of red and purple instead.<br>",
    "funfacts": "It is very similar to the flag of the neighbouring country <a href=\"?q=bahrain\">Bahrain</a>, which has fewer points, different colour and proportion.<br>The flag is the only national flag having a width more than twice its height.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Qatar"
  },
  {
    "tags": "réunion reunion red blue yellow triangle building",
    "shortname": "re",
    "name": "Réunion",
    "proportion": "2:3",
    "adopted": "2003",
    "symbolism": "Volcano: Depicts the volcano \"Piton de la Fournaise\", French for \"Peak of the Furnace\", which is a shield volcano on the Réunion island and one of the most active volcanoes in the world.<br>",
    "funfacts": "The official flag of Réunion is the flag of <a href=\"?q=france\">France</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_R%C3%A9union"
  },
  {
    "tags": "romania blue yellow red vertical stripes",
    "shortname": "ro",
    "name": "Romania",
    "proportion": "2:3",
    "adopted": "1989",
    "symbolism": "Blue: Liberty.<br>Yellow: Justice.<br>Red: Fraternity.<br>",
    "funfacts": "It is similar to the flag of <a href=\"?q=moldova\">Moldova</a>, reflecting the two countries' national and cultural affinity.<br>The design is also similar to the flags of <a href=\"?q=andorra\">Andorra</a> and <a href=\"?q=chad\">Chad</a> but that is believed to be coincidental.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Romania"
  },
  {
    "tags": "serbia red blue white fleur-de-lis horizontal stripes bird animal crown cross pan-slavic",
    "shortname": "rs",
    "name": "Serbia",
    "proportion": "2:3",
    "adopted": "2004",
    "symbolism": "Serbian eagle and cross: The national identity of the Serbian people across the centuries.<br>",
    "funfacts": "The Cyrillic C in each corner of the Serbian cross are thought to mean, \"Samo sloga Srbina spasava\" (\"Only unity will save the Serbs\").<br>The colors are the reverse of those on the flag of <a href=\"?q=russia\">Russia</a>, and various popular stories exist in Serbia which try to explain why.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Serbia"
  },
  {
    "tags": "russia white blue red horizontal stripes pan-slavic",
    "shortname": "ru",
    "name": "Russia",
    "proportion": "2:3",
    "adopted": "1993",
    "symbolism": "White: Nobility and frankness.<br>Blue: Faithfulness, honesty, impeccability and chastity.<br>Red: Courage, generosity and love.<br>",
    "funfacts": "It has its origin in the flag of the <a href=\"?q=netherlands\">Netherlands</a> and was made by simply changing the sequence of stripes.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Russia"
  },
  {
    "tags": "rwanda blue yellow green horizontal stripes sun circle",
    "shortname": "rw",
    "name": "Rwanda",
    "proportion": "2:3",
    "adopted": "2001",
    "symbolism": "Blue: Happiness and peace.<br>Yellow: Economic development.<br>Green: The hope of prosperity.<br>Sun: Enlightenment.<br>",
    "funfacts": "The previous flag of Rwanda used the <a href=\"?q=pan-african\">Pan-African</a> colors but was replaced (along with the national anthem) because of its strong association with the 1994 genocide.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Rwanda"
  },
  {
    "tags": "saudi arabia green white weapon text motto",
    "shortname": "sa",
    "name": "Saudi Arabia",
    "proportion": "2:3",
    "adopted": "1973",
    "symbolism": "Green: Islam.<br>Sword: The strictness in applying justice.<br>",
    "funfacts": "The inscription is the Islamic creed, or shahada, written in the calligraphic Thuluth script: \"There is no god but Allah; Muhammad is the Messenger of Allah\".<br>Because the shahada is considered holy, the flag is not normally used on T-shirts or other items.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Saudi_Arabia"
  },
  {
    "tags": "solomon islands blue yellow green white triangle star diagonal",
    "shortname": "sb",
    "name": "Solomon Islands",
    "proportion": "1:2",
    "adopted": "1977",
    "symbolism": "Blue: The water in the form of rivers, rain, and the Pacific Ocean.<br>Green: The land, the trees and crops that grow on it.<br>Yellow: The sun and its rays separating the land and the ocean.<br>Five stars: The five provinces of the country at the time of independence.<br>",
    "funfacts": "Unlike the flags of nearby <a href=\"?q=australia\">Australia</a>, <a href=\"?q=new+zealand\">New Zealand</a>, <a href=\"?q=papua+new+guinea\">Papua New Guinea</a>, and <a href=\"?q=samoa\">Samoa</a>, the stars on the flag does not represent the Southern cross.<br>The design was created by a New Zealander teaching visual arts at the time in the capital Honiara.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Solomon_Islands"
  },
  {
    "tags": "seychelles blue yellow red white green triangle pan-african diagonal",
    "shortname": "sc",
    "name": "Seychelles",
    "proportion": "1:2",
    "adopted": "1996",
    "symbolism": "Slanting bands: A dynamic new country moving into the future.<br>Blue: The sky and the sea that surrounds the Seychelles.<br>Yellow: The sun which gives light and life.<br>Red: The people and their determination to work for the future in unity and love.<br>White: Social justice and harmony.<br>Green: The land and natural environment.<br>",
    "funfacts": "The colours used in the current flag are the official colours of two of the nation's major political parties: the Seychelles People's United Party and the Seychelles Democratic Party.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Seychelles"
  },
  {
    "tags": "sudan red white black green triangle horizontal stripes pan-arab",
    "shortname": "sd",
    "name": "Sudan",
    "proportion": "1:2",
    "adopted": "1970",
    "symbolism": "Red: Sudan's struggle for independence and the sacrifices of the country's martyrs.<br>White: The people, light and optimism.<br>Black: Sudan; in Arabic, \"Sudan\" means \"land of the black people\".<br>Green: Islam, agriculture and the prosperity of the land.<br>",
    "funfacts": "The design is based on the Arab Liberation Flag of the Egyptian Revolution of 1952, as are the flags of <a href=\"?q=egypt\">Egypt</a>, <a href=\"?q=iraq\">Iraq</a>, <a href=\"?q=syria\">Syria</a>, and <a href=\"?q=yemen\">Yemen</a>. These are known as the <a href=\"?q=pan+arab\">Pan-Arab</a> colours.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Sudan"
  },
  {
    "tags": "sweden blue yellow cross",
    "shortname": "se",
    "name": "Sweden",
    "proportion": "5:8",
    "adopted": "1906",
    "symbolism": "Cross: Christianity.<br>Colours are of unknown origin.<br>",
    "funfacts": "Blue and yellow have been used as Swedish colours at least since Magnus III's royal coat of arms of 1275.<br>Based on the design of the flag of <a href=\"?q=denmark\">Denmark</a>, the Nordic <a href=\"?q=cross\">cross</a> is used in the flags of the nordic countries.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Sweden"
  },
  {
    "tags": "singapore red white horizontal stripes moon star",
    "shortname": "sg",
    "name": "Singapore",
    "proportion": "2:3",
    "adopted": "1959",
    "symbolism": "Red: Universal brotherhood and equality of man.<br>White: Pervading and everlasting purity and virtue.<br>Moon: Young nation on the ascendant.<br>Five stars: The nation's ideals of \"democracy, peace, progress, justice and equality\".<br>",
    "funfacts": "The commitee tasked with designing the flag initially wanted the entire background to be red, but the Cabinet decided against this, as red was regarded as a rallying point for communism.<br>The crescent moon is informally seen by the nation's Muslim activists to represent Islam.<br>The flag was originally exclusively used on or in front of buildings owned by the government, but rules have been relaxed since then.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Singapore"
  },
  {
    "tags": "saint helena brown blue white red cross british boat flag england animal bird waves",
    "shortname": "sh",
    "name": "Saint Helena",
    "proportion": "1:2",
    "adopted": "1984",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Bird: The national bird, the Saint Helena plover.<br>Ship: Coastal scene taken from the colonial seal and shows a with the flag of England.<br>",
    "funfacts": "The official flag of Saint Helena is the flag of the <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Saint_Helena"
  },
  {
    "tags": "slovenia white blue red horizontal stripes star mountain pan-slavic",
    "shortname": "si",
    "name": "Slovenia",
    "proportion": "1:2",
    "adopted": "1991",
    "symbolism": "Colours: The medieval coat of arms of the Duchy of Carniola (an imperial estate of the Holy Roman Empire).<br>Mountains: Mount Triglav, Slovenia's highest peak.<br>Waves: The Adriatic Sea and local rivers.<br>Stars: Counts of Celje, the great Slovene dynastic house of the late 14th and early 15th century.<br>",
    "funfacts": "The coat of arms was designed by Marko Pogačnik, a Slovenian artist and author.<br>Without the coat of arms, the flag is identical to the flag of Russia.<br>The colours are considered to be <a href=\"?q=pan-slavic\">Pan-Slavic</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Slovenia"
  },
  {
    "tags": "svalbard and jan mayen red white blue cross norway",
    "shortname": "sj",
    "name": "Svalbard and Jan Mayen",
    "proportion": "8:11",
    "adopted": "1821",
    "symbolism": "For symbolism regarding the Norwegian flag, see <a href=\"?q=norway\">Norway</a>.<br>",
    "funfacts": "While Svalbard does not have its own flag, one was proposed in 1930 which depicts the lion of the Norwegian coat of arms against a background of the Arctic archipelago.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Svalbard_and_Jan_Mayen"
  },
  {
    "tags": "slovakia white blue red horizontal stripes cross mountain pan-slavic",
    "shortname": "sk",
    "name": "Slovakia",
    "proportion": "2:3",
    "adopted": "1992",
    "symbolism": "Double cross: Slovak national symbol and Christianity which originated in the Byzantine (Eastern Roman) Empire in the 9th century.<br>Mountains: The three mountain ranges Tatra, Matra and Fatra.<br>Red in the coat of arms: The Slovak martyrdom during the time of Magyarisation.<br>",
    "funfacts": "The coat of arms was designed by Ladislav Čisárik, a Slovak painter and heraldic artist, and Ladislav Vrtel, an expert in heraldry.<br>Without the coat of arms, the flag is identical to the flag of <a href=\"?q=russia\">Russia</a>.<br>The colours are considered to be <a href=\"?q=pan-slavic\">Pan-Slavic</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Slovakia"
  },
  {
    "tags": "sierra leone green white blue horizontal stripes",
    "shortname": "sl",
    "name": "Sierra Leone",
    "proportion": "2:3",
    "adopted": "1961",
    "symbolism": "Green: The country's natural resources, specifically agriculture and its mountains.<br>White: Unity and justice.<br>Blue: The hope of contributing to world peace through the usage of the natural harbour of Freetown, the capital city of Sierra Leone.<br>",
    "funfacts": "The flag is used as a flag of convenience by foreign merchant vessels. The minimum enforcement of admiralty law on such vessels has led to illegal and suspicious activity.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Sierra_Leone"
  },
  {
    "tags": "san marino white blue horizontal stripes vegetation mountain crown ribbon cross text motto building",
    "shortname": "sm",
    "name": "San Marino",
    "proportion": "3:4",
    "adopted": "1862",
    "symbolism": "White: Peace.<br>Blue: Liberty.<br>Towers: The three citadels of San Marino (La Guaita, La Cesta and La Montale).<br>Hills: The three summits of Monte Titano.<br>Oak and laurel branch: The stability of the republic and the defense of the liberty.<br>Crown: Sovereignty.<br>",
    "funfacts": "The ribbon says \"Libertas\", Italian for \"Liberty\", and refers to the taking in of victims of political persecution in the earlier years of San Marino.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_San_Marino"
  },
  {
    "tags": "senegal green yellow red vertical stripes star pan-african",
    "shortname": "sn",
    "name": "Senegal",
    "proportion": "2:3",
    "adopted": "1960",
    "symbolism": "Green: Islam, hope and fecundity.<br>Yellow: Wealth, the product of work and the colour of arts, literature, and intellect.<br>Red: Blood, life and the sacrifice accepted by the nation as well as the strong determination to fight against underdevelopment.<br>Star: The five points of the star recall the human ideogram in the center of the flag of the former Mali Federation.<br>",
    "funfacts": "The design is inspired by the flag of <a href=\"?q=france\">France</a>.<br>The colours are the colours of the <a href=\"?q=pan-african\">Pan-Africanist</a> movement and is a sign of unity among African countries.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Senegal"
  },
  {
    "tags": "somalia blue white star",
    "shortname": "so",
    "name": "Somalia",
    "proportion": "2:3",
    "adopted": "2012",
    "symbolism": "Blue: The sky as well as the Gulf of Aden, Guardafui Channel and the Somali Sea.<br>Five-pointed star: Known as the Star of Unity and represents the areas where the Somali ethnic group has traditionally resided; Djibouti, Somaliland, the Somali region in <a href=\"?q=ethiopia\">Ethiopia</a>, the North Eastern Province in <a href=\"?q=kenya\">Kenya</a>, and Somalia.<br>",
    "funfacts": "Designed by Mohammed Awale Liban, a Somali scholar nationalist who served in all Somali governments up until 1964.<br>The flag is strictly prohibited in Somaliland, an unrecognised sovereign state internationally considered to be part of Somalia.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Somalia"
  },
  {
    "tags": "suriname green white red yellow horizontal stripes star",
    "shortname": "sr",
    "name": "Suriname",
    "proportion": "2:3",
    "adopted": "1975",
    "symbolism": "Red: Progress and hope.<br>White: Freedom, justice and independence.<br>Green: The fertility of the land.<br>Yellow star: Unity and a golden future, while the five points of the star represent the ethnic groups of East-Indians, Africans, Chinese, Europeans and Amerindians.<br>",
    "funfacts": "The first national flag of Suriname was designed to represent the diversity of the people and contained five different coloured stars; black (African), brown (Indians), yellow (Javanese and Chinese), red (American Indians), and white (Europeans). However, the flag was criticized by the wider public for putting too much emphasis on the ethnic differences and therefore symbolizing less of the national unity of the Surinamese people.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Suriname"
  },
  {
    "tags": "south sudan black blue red green yellow white triangle horizontal stripes star pan-african",
    "shortname": "ss",
    "name": "South Sudan",
    "proportion": "1:2",
    "adopted": "2005",
    "symbolism": "Black: The people of South Sudan.<br>Red: The blood that was shed for the independence of the country.<br>Green: The country's agricultural and natural wealth, land, as well as progress.<br>White: The peace attained after many years of the liberation struggle.<br>Blue: The Nile River, a source of life for the country.<br>Yellow star: Represents unity (of the states), hope, and determination for all people.<br>",
    "funfacts": "The flag is older than the country itself, as the flag was adopted in 2005, while the country became independent in 2011.<br>Similar to the flags of neighbouring countries <a href=\"?q=sudan\">Sudan</a> and <a href=\"?q=kenya\">Kenya</a>, using the symbolism of the <a href=\"?q=pan-african\">Pan-African</a> movement.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_South_Sudan"
  },
  {
    "tags": "são tomé and príncipe sao tome principe green yellow red black triangle horizontal stripes star pan-african",
    "shortname": "st",
    "name": "São Tomé and Príncipe",
    "proportion": "1:2",
    "adopted": "1975",
    "symbolism": "Green: The plentiful vegetation of the country.<br>Yellow: The tropical sun and cocoa, a key agricultural crop for the nation.<br>Red: Equality and the struggle for independence.<br>Stars: The two islands that make up the country.<br>",
    "funfacts": "The flag is coloured in the popular <a href=\"?q=pan-african\">Pan-African</a> colours of the <a href=\"?q=ethiopia\">Ethiopian flag</a>, reflecting both a break with the country's colonial past and its unity with other African ex-colonies.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_S%C3%A3o_Tom%C3%A9_and_Pr%C3%ADncipe"
  },
  {
    "tags": "el salvador blue white horizontal stripes vegetation mountain hat text motto name flag",
    "shortname": "sv",
    "name": "El Salvador",
    "proportion": "189:335",
    "adopted": "1912",
    "symbolism": "Blue: The skies of the country and the two massive oceans of Central America.<br>White: Peace, concordia and solidarity with the world.<br>Triangle: The three branches of the country's government: Executive, Legislative and Judiciary.<br>Five volcanoes: The fellowship of the five original isthmian member states of the United Provinces of Central America.<br>Phrygian cap on a staff: Freedom, inspired by the symbolism in the American and French Revolutions.<br>",
    "funfacts": "The proportion is specified as 189:335 which is close to 9:16.<br>The ribbon has the national motto written on it: Dios Unión Libertad (Spanish for \"God Union Liberty\").<br>One of only seven flags which shows a flag of itself.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_El_Salvador"
  },
  {
    "tags": "sint maarten blue red white yellow triangle horizontal stripes animal vegetation text motto ribbon building",
    "shortname": "sx",
    "name": "Sint Maarten",
    "proportion": "2:3",
    "adopted": "1985",
    "symbolism": "Red: Solidarity and courage.<br>Blue: Peace and assurance of pardon.<br>White: Purity and faith.<br>The Coat of arms contains several national symbols; the courthouse, the border monument, the national flower (orange-yellow sage) and national bird (the pelican).<br>",
    "funfacts": "Designed by 17 year old resident Roselle Richardson, her submission was picked in a competition of 115 entries.<br>The ribbon in the coat of arms has the Sint Maarten motto written on it: Semper pro grediens (Latin for \"always progressing\").<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Sint_Maarten"
  },
  {
    "tags": "syria red white blue green horizontal stripes star pan-arab",
    "shortname": "sy",
    "name": "Syria",
    "proportion": "2:3",
    "adopted": "1980",
    "symbolism": "Red (Hashemite dynasty): Courage, bravery, hardiness, strength, and unity.<br>White (Umayyad dynasty): Cleanliness, honesty, peace, and purity.<br>Green (Fatimid dynasty): Prosperity, hope, joy, love, and optimism.<br>Black (Abbasid dynasty): Defeating enemies and strength of mind.<br>",
    "funfacts": "Although Syria is not part of any Arab state union, the flag of the United Arab Republic was readopted to show Syria's commitment to Arab unity.<br>The colors are those used in the Arab Revolt and referred to as the <a href=\"?q=pan-arab\">Pan-Arab</a> colours.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Syria"
  },
  {
    "tags": "eswatini swaziland blue yellow red white black shield weapon horizontal stripes",
    "shortname": "sz",
    "name": "Eswatini",
    "proportion": "2:3",
    "adopted": "1968",
    "symbolism": "Red: Past battles.<br>Blue: Peace and stability<br>Yellow: The resources of the country.<br>Nguni shield and two spears:Protection from the country's enemies. Its colour is meant to show that white and black people live in peaceful coexistence in Eswatini.<br>",
    "funfacts": "From the shield and spears hang injobo tassels, feathers of the widowbird and the lourie. These feathers are used only by the king.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Eswatini"
  },
  {
    "tags": "turks and caicos islands blue white red yellow cross british animal vegetation",
    "shortname": "tc",
    "name": "Turks and Caicos Islands",
    "proportion": "1:2",
    "adopted": "1968",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Coat of arms: The conch shell and lobster represents the islands' primary industry of fishing while the Melocactus symbolises the territory's biome.<br>",
    "funfacts": "The Melocactus, which is visually similar to the traditional Turkish fez, give the islands the first half of their name.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Turks_and_Caicos_Islands"
  },
  {
    "tags": "chad blue yellow red vertical stripes pan-african",
    "shortname": "td",
    "name": "Chad",
    "proportion": "2:3",
    "adopted": "1959",
    "symbolism": "Blue: The sky and hope.<br>Yellow: The sun and desert.<br>Red: The bloodshed over independence.<br>",
    "funfacts": "The design was intended to be a combination of the colours of blue, white and red as seen on the flag of <a href=\"?q=france\">France</a> with the <a href=\"?q=pan-african\">Pan-African</a> colours of green, yellow and red.<br>It is similar to the flags of <a href=\"?q=andorra\">Andorra</a>, <a href=\"?q=romania\">Romania</a> and <a href=\"?q=moldova\">Moldova</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Chad"
  },
  {
    "tags": "french southern and antarctic lands red white blue star vertical stripes text",
    "shortname": "tf",
    "name": "French Southern and Antarctic Lands",
    "proportion": "2:3",
    "adopted": "2007",
    "symbolism": "For symbolism regarding the flag of France, see <a href=\"?q=france\">France</a>.<br>Five stars: The administrative districts that make up the territory; Adélie Land, Crozet Islands, Kerguelen Islands, Saint Paul & Amsterdam Islands and the Scattered Islands in the Indian Ocean.<br>",
    "funfacts": "The letters \"TAAF\" in the monogram comes from the French name of the territory; \"Terres australes et antarctiques françaises\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Antarctica#French_Southern_and_Antarctic_Territories"
  },
  {
    "tags": "togo green yellow red white horizontal stripes star pan-african",
    "shortname": "tg",
    "name": "Togo",
    "proportion": "1:φ",
    "adopted": "1960",
    "symbolism": "Red: Blood shed by Martyrs to gain independence.<br>White star: Hope.<br>Green: The forests, agriculture, nature, and overall hope for the future.<br>Yellow: The natural resources of the country.<br>",
    "funfacts": "Designed by Togolese artist Paul Ahyi.<br>The proportions are specified as the golden ratio φ ≈ 1.618034, making the flag of Togo one out of the only two national flags with irrational proportions (the other being <a href=\"?q=nepal\">Nepal</a>).<br>The flag is coloured in the popular <a href=\"?q=pan-african\">Pan-African</a> colours of the <a href=\"?q=ethiopia\">Ethiopian</a> flag, reflecting both a break with the country's colonial past and its unity with other African ex-colonies.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Togo"
  },
  {
    "tags": "thailand red white blue horizontal stripes",
    "shortname": "th",
    "name": "Thailand",
    "proportion": "2:3",
    "adopted": "1917",
    "symbolism": "Red: The land and people.<br>White: Religions.<br>Blue: Monarchy.<br>",
    "funfacts": "Legend says that during a flood, King Vajiravudh (Rama VI) saw the flag hanging upside-down. To prevent this from happening again he created a new flag which was symmetrical.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Thailand"
  },
  {
    "tags": "tajikistan red white green horizontal stripes star crown",
    "shortname": "tj",
    "name": "Tajikistan",
    "proportion": "1:2",
    "adopted": "1992",
    "symbolism": "Red: The unity of the nation as well as victory and sunrise.<br>White: Purity, morality, the snow and ice of the mountains as well as cotton.<br>Green: The generosity of nature, fertile valleys, the religion of Islam, and the celebration of Nowruz (Iranian New Year).<br>Crown: The Samanid dynasty and Tajik people, as the name Tajik is connected with Persian tâj, \"crown\", in popular etymology.<br>Seven stars: The number seven in Tajik traditional legends represents perfection and happiness.<br>",
    "funfacts": "Other interpretations of the colours state that the flag symbolically unifies the people of Tajik society, with the red stripe representing the manual labour class, the white stripe representing the intellectual worker class, and the green representing the agricultural class living in Tajikistan's rural or mountainous regions.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Tajikistan"
  },
  {
    "tags": "tokelau blue yellow white triangle star boat",
    "shortname": "tk",
    "name": "Tokelau",
    "proportion": "1:2",
    "adopted": "2009",
    "symbolism": "Boat: A Polynesian canoe representing the journey towards finding the best governance structure for its people.<br>Stars: The Southern cross constellation used as a guide and also the three main islands as well as Swains Island (administered by the <a href=\"?q=united+states\">United States</a> but claimed by Tokelau).<br>",
    "funfacts": "The positions of the stars was changed in 2007, previously showing a representation of the geographic location of the islands.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Tokelau"
  },
  {
    "tags": "timor-leste east timor red yellow black white triangle star",
    "shortname": "tl",
    "name": "Timor-Leste (East Timor)",
    "proportion": "1:2",
    "adopted": "2002",
    "symbolism": "Yellow: The traces of colonialism in East Timor's history.<br>Black: The obscurantism that needs to be overcome.<br>Red: The struggle for national liberation.<br>Star: The light that guides.<br>White: Peace.<br>",
    "funfacts": "Adopted for the first time in 1975 when the country declared its independence from Portugal, just nine days before being invaded by <a href=\"?q=indonesia\">Indonesia</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_East_Timor"
  },
  {
    "tags": "turkmenistan green red vertical stripe carpet moon star vegetation",
    "shortname": "tm",
    "name": "Turkmenistan",
    "proportion": "2:3",
    "adopted": "2001",
    "symbolism": "Green: Historically associated with the people of Turkmenistan.<br>Red stripe: The country's famous carpet industry, with five traditional designs representing the major tribes and houses.<br>Moon: Islam and the hope of the country for a shining future.<br>Five stars: The five provinces (welayatlar) of Turkmenistan; Ahal, Balkan, Dashoguz, Lebap and Mary.<br>Crossed olive branches: The status of permanent neutrality and the peace-loving nature of the Turkmen people.<br>",
    "funfacts": "The five traditional carpet designs in the red stripe make the flag of Turkmenistan the most complex national flag design in the world.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Turkmenistan"
  },
  {
    "tags": "tunisia red white circle star",
    "shortname": "tn",
    "name": "Tunisia",
    "proportion": "2:3",
    "adopted": "1999",
    "symbolism": "Red: The blood of martyrs killed during the Crusades before the advent of the Ottomans on 1574.<br>White: Peace.<br>Disk: The radiance of the nation as the sun.<br>Crescent and five-pointed star: Unity of all Muslims and the Five Pillars of Islam.<br>",
    "funfacts": "The red crescent and the five-pointed star, two ancient symbols of Islam, were most notably used on the flag of the Ottoman Empire and have since appeared on many flags of Islamic countries.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Tunisia"
  },
  {
    "tags": "tonga red white cross",
    "shortname": "to",
    "name": "Tonga",
    "proportion": "1:2",
    "adopted": "1875",
    "symbolism": "Red: The sacrifice of the Blood of Christ, which he shed during his Crucifixion.<br>White: Purity.<br>Red cross: Christianity.<br>",
    "funfacts": "The Tongan constitution stipulates that the national flag can never be changed.<br>It has some similarities with the flags of <a href=\"?q=switzerland\">Switzerland</a> and <a href=\"?q=georgia\">Georgia</a>.<br>The previous Tongan flag was a centered red cross on a white field. It was later changed because it was almost identical to the emblem of the International Red Cross.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Tonga"
  },
  {
    "tags": "turkey red white moon star",
    "shortname": "tr",
    "name": "Turkey",
    "proportion": "2:3",
    "adopted": "1844",
    "symbolism": "Crescent and five-pointed star: Unity of all Muslims and the Five Pillars of Islam.<br>",
    "funfacts": "The current design of the Turkish flag is directly derived from the late Ottoman flag.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Turkey"
  },
  {
    "tags": "trinidad tobago red white black triangle stripes diagonal",
    "shortname": "tt",
    "name": "Trinidad and Tobago",
    "proportion": "3:5",
    "adopted": "1962",
    "symbolism": "Red: Fire (the sun and courage).<br>Black: Earth (dedication).<br>White: Water (purity and equality).<br>",
    "funfacts": "Designed by Carlisle Chang, an artist considered the father of Trinidad Art.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Trinidad_and_Tobago"
  },
  {
    "tags": "tuvalu blue red white yellow cross british star",
    "shortname": "tv",
    "name": "Tuvalu",
    "proportion": "1:2",
    "adopted": "1997",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Stars: The nine islands which comprise Tuvalu.<br>",
    "funfacts": "The arrangement of the stars is geographically correct, but with the east towards the top (i.e. north to the left).<br>In 1995 the flag was updated to show only eight stars to reflect the name \"Tuvalu\" meaning \"eight standing together\" and refers to the eight inhabited islands. However, due pressure from the public, the ninth star was reinstated in 1997.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Tuvalu"
  },
  {
    "tags": "taiwan red blue white circle sun",
    "shortname": "tw",
    "name": "Taiwan",
    "proportion": "2:3",
    "adopted": "1945",
    "symbolism": "Blue sky with white sun: The emblem of the political party Kuomintang with the rays representing progress.<br>Red: The blood of the revolutionaries who sacrificed themselves in order to overthrow the Qing dynasty.<br>",
    "funfacts": "The flag is also known as \"Blue Sky, White Sun, and a Wholly Red Earth\".<br>Public display of the flag is outlawed for public use in mainland <a href=\"?q=china\">China</a>, except for historical uses inside historical places.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_Republic_of_China"
  },
  {
    "tags": "tanzania green yellow black blue triangle stripes diagonal",
    "shortname": "tz",
    "name": "Tanzania",
    "proportion": "2:3",
    "adopted": "1964",
    "symbolism": "Green: The natural vegetation and rich agricultural resources of the country.<br>Black: The Swahili people who are native to Tanzania.<br>Blue: The Indian Ocean, as well as the nation's numerous lakes and rivers.<br>Yellow: Mineral wealth and the rich deposits in the land.<br>",
    "funfacts": "It is one of a relatively small number of national flags incorporating a <a href=\"?q=diagonal\">diagonal</a> line.<br>Designed as a combination of the flags from the nations that united to form Tanzania; Tanganyika and Zanzibar.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Tanzania"
  },
  {
    "tags": "ukraine blue yellow horizontal stripes",
    "shortname": "ua",
    "name": "Ukraine",
    "proportion": "2:3",
    "adopted": "1992",
    "symbolism": "Blue: Water and alternatively the Dnieper river.<br>Yellow: Fire and alternatively the golden domes (cupolas) of Christian churches.<br>",
    "funfacts": "The earliest known reference of the source of the colours are from pre-Christian times, during the 15th century.<br>In the early 20th century, the flag was yellow on top and blue on the bottom. Hence the alternative symbolism of the river running underneath churches.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Ukraine"
  },
  {
    "tags": "uganda black yellow red horizontal stripes circle bird animal",
    "shortname": "ug",
    "name": "Uganda",
    "proportion": "2:3",
    "adopted": "1962",
    "symbolism": "Bird: The national <a href=\"?q=bird\">bird</a> of Uganda (the Grey crowned crane) and the raised leg is a symbol of the forward movement of the country.<br>Black: The Native ethnic groups of Africa.<br>Yellow: Africa's sunshine.<br>Red: African brotherhood, the blood of all Africans.<br>",
    "funfacts": "The crane emblem was selected by the British colonial authorities as a way of promoting unity between the traditional kingdoms in Uganda.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Uganda"
  },
  {
    "tags": "united states minor outlying islands red white blue horizontal stripes star",
    "shortname": "um",
    "name": "United States Minor Outlying Islands",
    "proportion": "10:19",
    "adopted": "1986",
    "symbolism": "For symbolism regarding the Star-Spangled Banner, see <a href=\"?q=united+states\">United States</a>.<br>",
    "funfacts": "The official flag is that of the <a href=\"?q=united+states\">United States</a>.<br>"
  },
  {
    "tags": "usa united states america red white blue horizontal stripes star",
    "shortname": "us",
    "name": "United States",
    "proportion": "10:19",
    "adopted": "1960",
    "symbolism": "White: Purity and innocence.<br>Red: Hardiness and valor.<br>Blue: Vigilance, perseverance and justice.<br>Stars: The 50 states of the United States of America.<br>Stripes: The thirteen British colonies that declared independence from the Kingdom of Great Britain, and became the first states in the U.S.<br>",
    "funfacts": "Also known as the Star-Spangled Banner (as mentioned in the national anthem) or Stars and Stripes.<br>If a new U.S. state were to be admitted (like District of Columbia or <a href=\"?q=puerto+rico\">Puerto Rico</a>), it would require a new design of the flag to add a star for the 51st state.<br>However, according to the U.S. Army Institute of Heraldry, the United States flag never becomes obsolete. Any approved American flag may continue to be used and displayed until no longer serviceable.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_United_States"
  },
  {
    "tags": "uruguay white blue horizontal stripes sun face",
    "shortname": "uy",
    "name": "Uruguay",
    "proportion": "2:3",
    "adopted": "1830",
    "symbolism": "Stripes: The nine original departments of Uruguay (reduced to four stripes because of visibility).<br>Sun: The Sun of May which represents the May Revolution of 1810 and Inti, the sun god and mythological founder of the Incan Empire.<br>",
    "funfacts": "Designed by Joaquín Suárez, a Uruguayan political figure.<br>The flag above is one of three official flags of Uruguay.<br>The <a href=\"?q=sun\">Sun</a> of May is also found on the flag of <a href=\"?q=argentina\">Argentina</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Uruguay"
  },
  {
    "tags": "uzbekistan blue white green red horizontal stripes moon star",
    "shortname": "uz",
    "name": "Uzbekistan",
    "proportion": "1:2",
    "adopted": "1991",
    "symbolism": "Blue: The sky and clear water. It is also the colour of the Turkic peoples.<br>White: Peace and good luck.<br>Green: Nature, new life, and good harvest.<br>Red: The power of life.<br>Moon: Islam, and the birth of a new nation.<br>Stars: Spirituality and divinity as well as a symbol of the pursuit of perfection and happiness of the Uzbek people in their homeland.<br>",
    "funfacts": "Partly inspired by the flag of the Uzbek Soviet Socialist Republic.<br>Uzbekistan became the first of the newly independent republics previously a part of the Soviet Union in Central Asia to choose a new flag.<br>Shares some elements with the flag of <a href=\"?q=lesotho\">Lesotho</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Uzbekistan"
  },
  {
    "tags": "vatican city yellow white vertical stripes crown",
    "shortname": "va",
    "name": "Vatican City",
    "proportion": "1:1",
    "adopted": "1929",
    "symbolism": "Crown: The papal tiara, a crown worn by popes of the Catholic Church until 1963.<br>Two keys: The keys of heaven given by Jesus Christ to St Peter. Gold represents spiritual power, while the silver key represents worldly power.<br>",
    "funfacts": "It is displayed in many Catholic churches worldwide, often alongside the national flag of where the church is located.<br>It is one of only two square sovereign-state flags, the other being the flag of <a href=\"?q=switzerland\">Switzerland</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Vatican_City"
  },
  {
    "tags": "saint vincent grenadines blue yellow green vertical stripes",
    "shortname": "vc",
    "name": "Saint Vincent and the Grenadines",
    "proportion": "2:3",
    "adopted": "1985",
    "symbolism": "V: The first letter of the country's name, and its nickname as the \"Gems of the Antilles\".<br>Blue: The sky and the sea.<br>Yellow: The colour of the islands' sand, the sunshine, and the \"bright spirit\" of the islanders.<br>Green: The country's plentiful vegetation, as well as the vitality of Vincentians.<br>",
    "funfacts": "The flag is utilised as a flag of convenience by foreign merchant vessels and offers many advantages for the ships, such as less expensive fees and lax rules regarding crew, safety, and the environment but this naturally attracts illegal and suspicious activities.<br>The swiss graphic artist Julien van der Wal was tasked with modernizing the flag and created the V symbol of diamonds which replaced the coat of arms consisting of a breadfruit leaf.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Saint_Vincent_and_the_Grenadines"
  },
  {
    "tags": "venezuela yellow blue red horizontal stripes star",
    "shortname": "ve",
    "name": "Venezuela",
    "proportion": "2:3",
    "adopted": "2006",
    "symbolism": "Yellow: The riches of the country, the wealth of Venezuelan soil, gold, sovereignty, harmony, justice and agriculture, as well as the Sun.<br>Blue: The Sea of the Caribbean that surrounds the country, as well as the Venezuelan beaches.<br>Red: The spilled blood in the battle of independence from Spain.<br>Stars: The seven provinces of Venezuela that signed the declaration of independence (Caracas, Cumaná, Barcelona, Barinas, Margarita, Mérida and Trujillo) and Guayana.<br>",
    "funfacts": "The flag is essentially the one designed by Francisco de Miranda for his unsuccessful 1806 expedition to liberate Venezuela and later adopted by the National Congress of 1811. This is also the inspiration for the flags of <a href=\"?q=colombia\">Colombia</a> and <a href=\"?q=ecuador\">Ecuador</a>.<br>Alternative symbolism for the flag is that the \"golden\" America is separated from the bloody Spain by the deep blue sea.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Venezuela"
  },
  {
    "tags": "british virgin islands white blue red green yellow cross human text motto ribbon shield",
    "shortname": "vg",
    "name": "British Virgin Islands",
    "proportion": "1:2",
    "adopted": "1960",
    "symbolism": "For symbolism regarding the Union Jack, see <a href=\"?q=united+kingdom\">United Kingdom</a>.<br>Person and oil lamps: Saint Ursula, the patron saint of the Virgin Islands, with her 11.000 virgin followers which the islands are named after by Christopher Columbus.<br>",
    "funfacts": "The ribbon has the <a href=\"?q=motto\">motto</a> of the islands on it in Latin; \"Vigilate\" meaning \"be vigilant\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_British_Virgin_Islands"
  },
  {
    "tags": "united states virgin islands white blue yellow red animal bird vegetation weapon shield text vertical stripes",
    "shortname": "vi",
    "name": "United States Virgin Islands",
    "proportion": "2:3",
    "adopted": "1921",
    "symbolism": "Eagle: A simplified version of the coat of arms of the <a href=\"?q=united+states\">United States</a>.<br>Laurel: Victory.<br>Arrows: The three major islands that make up the U.S. Virgin Islands: Saint Croix, Saint Thomas, and Saint John.<br>V I: Abbreviating the Virgin Islands.<br>",
    "funfacts": "The design came to be when the governor of the islands approached the captain of the USS Grebe (a minesweeper ship) and the cartoonist Percival Wilson Sparks for suggestions. Sparks asked his wife and sister to embroider the design and this became the flag of U.S. Virgin Islands.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_the_United_States_Virgin_Islands"
  },
  {
    "tags": "vietnam red yellow star",
    "shortname": "vn",
    "name": "Vietnam",
    "proportion": "2:3",
    "adopted": "1955",
    "symbolism": "Red: Revolution and bloodshed.<br>Star: The five main classes in Vietnamese society; workers, farmers, soldiers, intellectuals, and entrepreneurs.<br>",
    "funfacts": "Although the flag was not representing Vietnam until 1945 it was designed in 1940 and used during an uprising against the <a href=\"?q=france\">French</a> in southern Vietnam as well as by the Viet Minh, a communist-led organization created in 1941 to oppose Japanese occupation.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Vietnam"
  },
  {
    "tags": "vanuatu red green yellow black triangle vegetation horizontal",
    "shortname": "vu",
    "name": "Vanuatu",
    "proportion": "19:36",
    "adopted": "1980",
    "symbolism": "Green: The richness of the islands.<br>Red: Blood which unites humanity as humans.<br>Black: The ni-Vanuatu people.<br>Yellow Y-shape: The shape of Vanuatu islands on the map and the light of the gospel going through the pattern of the islands in the Pacific Ocean.<br>Emblem: A boar's tusk representing customs and tradition but also prosperity, and two leaves of the local namele tree which represents peace.<br>",
    "funfacts": "The Prime Minister of Vanuatu, Father Walter Lini, requested the inclusion of yellow and black lines to make the black stand out.<br>The design is very similar to the flag of <a href=\"?q=south+africa\">South Africa</a>.<br>The origin of the design is a similar flag adopted by the political party Vanua'aku Pati which led the New Hebrides (now Vanuatu) to independence in 1980.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Vanuatu"
  },
  {
    "tags": "wallis and futuna red blue white triangle vertical stripes cross",
    "shortname": "wf",
    "name": "Wallis and Futuna",
    "proportion": "2:3",
    "adopted": "1985",
    "symbolism": "For symbolism regarding the Tricolour, see <a href=\"?q=france\">France</a>.<br>Red: Courage.<br>White: Purity of ideals.<br>Triangles: The three native kings of the islands, and the French administrator.<br>",
    "funfacts": "The official flag of Wallis and Futuna is the flag of <a href=\"?q=france\">France</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Wallis_and_Futuna"
  },
  {
    "tags": "samoa red blue white star",
    "shortname": "ws",
    "name": "Samoa",
    "proportion": "1:2",
    "adopted": "1962",
    "symbolism": "Red: Courage.<br>Blue: Freedom and justice.<br>White: Purity.<br>Stars: The Southern cross constellation representing the Southern Hemisphere.<br>",
    "funfacts": "The design is similar to the flag of <a href=\"?q=taiwan\">Taiwan</a> but believed to be designed independently.<br>Other flags displaying the Southern cross are for example <a href=\"?q=australia\">Australia</a>, <a href=\"?q=new+zealand\">New Zealand</a> and <a href=\"?q=papua+new+guinea\">Papua New Guinea</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Samoa"
  },
  {
    "tags": "kosovo blue yellow white star map",
    "shortname": "xk",
    "name": "Kosovo",
    "proportion": "5:7",
    "adopted": "2008",
    "symbolism": "Stars: Kosovo's six major ethnic groups; Albanians, Serbs, Bosniaks, Turks, Romani, and Gorani.<br>Map: Stylized layout of the country.<br>",
    "funfacts": "The flag design emerged from an international competition, organized by the United Nations-backed Kosovo Unity Team, which attracted almost one thousand entries.<br>One of only a few other flags with a <a href=\"?q=map\">map</a> of the country on them, others are for example <a href=\"?q=cyprus\">Cyprus</a> and <a href=\"?q=christmas+island\">Christmas Island</a>.<br>Both the <a href=\"?q=serbia\">Serbian</a> and <a href=\"?q=albania\">Albanian</a> flags are common in Kosovo as they are used as ethnic flags for Serbians and Kosovo Albanians respectively.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Kosovo"
  },
  {
    "tags": "yemen red white black horizontal stripes pan-arab",
    "shortname": "ye",
    "name": "Yemen",
    "proportion": "2:3",
    "adopted": "1990",
    "symbolism": "Red: Unity and the bloodshed of martyrs.<br>White: A bright future.<br>Black: The dark past.<br>",
    "funfacts": "The flag is essentially the Arab Liberation Flag of 1952, introduced after the Egyptian Revolution, which is using the <a href=\"?q=pan-arab\">Pan-Arab</a> colours.<br>Other flags based on the Arab Liberation Flag are those of <a href=\"?q=egypt\">Egypt</a>, <a href=\"?q=iraq\">Iraq</a>, <a href=\"?q=sudan\">Sudan</a> and <a href=\"?q=syria\">Syria</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Yemen"
  },
  {
    "tags": "mayotte white red blue yellow grey text name ribbon animal vegetation moon star",
    "shortname": "yt",
    "name": "Mayotte",
    "proportion": "REPLACE",
    "adopted": "1982",
    "symbolism": "Blue and red: The Flag of France.<br>Seahorses: A reference to the shape of the main island.<br>Moon: Islam, the main religion of Mayotte.<br>Yellow flowers: Ylang-ylang flowers which represent the main agricultural resource on the island.<br>",
    "funfacts": "The official flag of Mayotte is the flag of <a href=\"?q=france\">France</a>.<br>Designed by Michel Chabin (former director of the Reunion Archives) and painted by local artist Pascale Santerre.<br>The ribbon displays the Mayotte <a href=\"?q=motto\">motto</a>, \"Ra Hachiri\", which is Shimaore for \"We are vigilant\".<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_and_coat_of_arms_of_Mayotte"
  },
  {
    "tags": "south africa red gren blue white yellow black triangle horizontal pan-african",
    "shortname": "za",
    "name": "South Africa",
    "proportion": "2:3",
    "adopted": "1994",
    "symbolism": "The South African government says that \"no universal symbolism should be attached to any of the colours\".<br>The Y shape: The convergence of diverse elements within South African society, taking the road ahead in unity.<br>",
    "funfacts": "The origins of the colours black, green and gold are from the flag of the African National Congress while the red, white and blue comes from the flag of <a href=\"?q=netherlands\">Netherlands</a>.<br>When adopted, it was the only national flag in the world to have six colours in its design (without a coat of arms).<br>Designed by Fred Brownell (South African state herald) who also designed the flag of <a href=\"?q=namibia\">Namibia</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_South_Africa"
  },
  {
    "tags": "zambia green red black orange bird animal vertical stripes pan-african",
    "shortname": "zm",
    "name": "Zambia",
    "proportion": "2:3",
    "adopted": "1996",
    "symbolism": "Green: The country's natural resources and vegetation.<br>Red: The struggle for freedom.<br>Black: The population of the country.<br>Orange: Mineral wealth (primarily copper).<br>Bird: The people's ability to rise above the nation's problems.<br>",
    "funfacts": "The bird is an African fish eagle, the national bird of Zambia, <a href=\"?q=namibia\">Namibia</a> and <a href=\"?q=zimbabwe\">Zimbabwe</a>.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Zambia"
  },
  {
    "tags": "zimbabwe green yellow red black white horizontal stripes star bird animal pan-african",
    "shortname": "zw",
    "name": "Zimbabwe",
    "proportion": "1:2",
    "adopted": "1980",
    "symbolism": "Green: The agriculture and rural areas.<br>Yellow: The wealth of minerals in the country, primarily gold.<br>Red: The blood shed during the first and second Chimurenga (wars) in the \"struggle for independence\".<br>Black: The heritage, race and ethnicity of the black majority.<br>White: Peace.<br>Bird: The history of Zimbabwe.<br>Red star: The nation's aspirations and the revolutionary struggle for freedom and peace.<br>",
    "funfacts": "The design is based on the flag of Zimbabwe's ruling party, the Zimbabwe African National Union - Patriotic Front.<br>The bird is known as a Zimbabwe Bird, it is the national emblem of Zimbabwe and representing a statue found at the ruins of the medieval city of Great Zimbabwe.<br>The flag is coloured in the popular <a href=\"?q=pan-african\">Pan-African</a> colours of the <a href=\"?q=ethiopia\">Ethiopian</a> flag, reflecting both a break with the country's colonial past and its unity with other African ex-colonies.<br>",
    "wikipedialink": "https://en.wikipedia.org/wiki/Flag_of_Zimbabwe"
  }
]
